MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K80/mcu.h
extern volatile MSEL2bits_t MSEL2bits __at(0xE7B);
// bitfield macros
#define _MSEL2_FIL8_POSN                                    0x0
#define _MSEL2_FIL8_POSITION                                0x0
#define _MSEL2_FIL8_SIZE                                    0x2
#define _MSEL2_FIL8_LENGTH                                  0x2
#define _MSEL2_FIL8_MASK                                    0x3
#define _MSEL2_FIL9_POSN                                    0x2
#define _MSEL2_FIL9_POSITION                                0x2
#define _MSEL2_FIL9_SIZE                                    0x2
#define _MSEL2_FIL9_LENGTH                                  0x2
#define _MSEL2_FIL9_MASK                                    0xC
#define _MSEL2_FIL10_POSN                                   0x4
#define _MSEL2_FIL10_POSITION                               0x4
#define _MSEL2_FIL10_SIZE                                   0x2
#define _MSEL2_FIL10_LENGTH                                 0x2
#define _MSEL2_FIL10_MASK                                   0x30
#define _MSEL2_FIL11_POSN                                   0x6
#define _MSEL2_FIL11_POSITION                               0x6
#define _MSEL2_FIL11_SIZE                                   0x2
#define _MSEL2_FIL11_LENGTH                                 0x2
#define _MSEL2_FIL11_MASK                                   0xC0
#define _MSEL2_FIL8_0_POSN                                  0x0
#define _MSEL2_FIL8_0_POSITION                              0x0
#define _MSEL2_FIL8_0_SIZE                                  0x1
#define _MSEL2_FIL8_0_LENGTH                                0x1
#define _MSEL2_FIL8_0_MASK                                  0x1
#define _MSEL2_FIL8_1_POSN                                  0x1
#define _MSEL2_FIL8_1_POSITION                              0x1
#define _MSEL2_FIL8_1_SIZE                                  0x1
#define _MSEL2_FIL8_1_LENGTH                                0x1
#define _MSEL2_FIL8_1_MASK                                  0x2
#define _MSEL2_FIL9_0_POSN                                  0x2
#define _MSEL2_FIL9_0_POSITION                              0x2
#define _MSEL2_FIL9_0_SIZE                                  0x1
#define _MSEL2_FIL9_0_LENGTH                                0x1
#define _MSEL2_FIL9_0_MASK                                  0x4
#define _MSEL2_FIL9_1_POSN                                  0x3
#define _MSEL2_FIL9_1_POSITION                              0x3
#define _MSEL2_FIL9_1_SIZE                                  0x1
#define _MSEL2_FIL9_1_LENGTH                                0x1
#define _MSEL2_FIL9_1_MASK                                  0x8
#define _MSEL2_FIL10_0_POSN                                 0x4
#define _MSEL2_FIL10_0_POSITION                             0x4
#define _MSEL2_FIL10_0_SIZE                                 0x1
#define _MSEL2_FIL10_0_LENGTH                               0x1
#define _MSEL2_FIL10_0_MASK                                 0x10
#define _MSEL2_FIL10_1_POSN                                 0x5
#define _MSEL2_FIL10_1_POSITION                             0x5
#define _MSEL2_FIL10_1_SIZE                                 0x1
#define _MSEL2_FIL10_1_LENGTH                               0x1
#define _MSEL2_FIL10_1_MASK                                 0x20
#define _MSEL2_FIL11_0_POSN                                 0x6
#define _MSEL2_FIL11_0_POSITION                             0x6
#define _MSEL2_FIL11_0_SIZE                                 0x1
#define _MSEL2_FIL11_0_LENGTH                               0x1
#define _MSEL2_FIL11_0_MASK                                 0x40
#define _MSEL2_FIL11_1_POSN                                 0x7
#define _MSEL2_FIL11_1_POSITION                             0x7
#define _MSEL2_FIL11_1_SIZE                                 0x1
#define _MSEL2_FIL11_1_LENGTH                               0x1
#define _MSEL2_FIL11_1_MASK                                 0x80

// Register: MSEL3
#define MSEL3 MSEL3
extern volatile unsigned char           MSEL3               __at(0xE7C);
#ifndef _LIB_BUILD
asm("MSEL3 equ 0E7Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIL12                  :2;
        unsigned FIL13                  :2;
        unsigned FIL14                  :2;
        unsigned FIL15                  :2;
    };
    struct {
        unsigned FIL12_0                :1;
        unsigned FIL12_1                :1;
        unsigned FIL13_0                :1;
        unsigned FIL13_1                :1;
        unsigned FIL14_0                :1;
        unsigned FIL14_1                :1;
        unsigned FIL15_0                :1;
        unsigned FIL15_1                :1;
    };
} MSEL3bits_t;
extern volatile MSEL3bits_t MSEL3bits __at(0xE7C);
// bitfield macros
#define _MSEL3_FIL12_POSN                                   0x0
#define _MSEL3_FIL12_POSITION                               0x0
#define _MSEL3_FIL12_SIZE                                   0x2
#define _MSEL3_FIL12_LENGTH                                 0x2
#define _MSEL3_FIL12_MASK                                   0x3
#define _MSEL3_FIL13_POSN                                   0x2
#define _MSEL3_FIL13_POSITION                               0x2
#define _MSEL3_FIL13_SIZE                                   0x2
#define _MSEL3_FIL13_LENGTH                                 0x2
#define _MSEL3_FIL13_MASK                                   0xC
#define _MSEL3_FIL14_POSN                                   0x4
#define _MSEL3_FIL14_POSITION                               0x4
#define _MSEL3_FIL14_SIZE                                   0x2
#define _MSEL3_FIL14_LENGTH                                 0x2
#define _MSEL3_FIL14_MASK                                   0x30
#define _MSEL3_FIL15_POSN                                   0x6
#define _MSEL3_FIL15_POSITION                               0x6
#define _MSEL3_FIL15_SIZE                                   0x2
#define _MSEL3_FIL15_LENGTH                                 0x2
#define _MSEL3_FIL15_MASK                                   0xC0
#define _MSEL3_FIL12_0_POSN                                 0x0
#define _MSEL3_FIL12_0_POSITION                             0x0
#define _MSEL3_FIL12_0_SIZE                                 0x1
#define _MSEL3_FIL12_0_LENGTH                               0x1
#define _MSEL3_FIL12_0_MASK                                 0x1
#define _MSEL3_FIL12_1_POSN                                 0x1
#define _MSEL3_FIL12_1_POSITION                             0x1
#define _MSEL3_FIL12_1_SIZE                                 0x1
#define _MSEL3_FIL12_1_LENGTH                               0x1
#define _MSEL3_FIL12_1_MASK                                 0x2
#define _MSEL3_FIL13_0_POSN                                 0x2
#define _MSEL3_FIL13_0_POSITION                             0x2
#define _MSEL3_FIL13_0_SIZE                                 0x1
#define _MSEL3_FIL13_0_LENGTH                               0x1
#define _MSEL3_FIL13_0_MASK                                 0x4
#define _MSEL3_FIL13_1_POSN                                 0x3
#define _MSEL3_FIL13_1_POSITION                             0x3
#define _MSEL3_FIL13_1_SIZE                                 0x1
#define _MSEL3_FIL13_1_LENGTH                               0x1
#define _MSEL3_FIL13_1_MASK                                 0x8
#define _MSEL3_FIL14_0_POSN                                 0x4
#define _MSEL3_FIL14_0_POSITION                             0x4
#define _MSEL3_FIL14_0_SIZE                                 0x1
#define _MSEL3_FIL14_0_LENGTH                               0x1
#define _MSEL3_FIL14_0_MASK                                 0x10
#define _MSEL3_FIL14_1_POSN                                 0x5
#define _MSEL3_FIL14_1_POSITION                             0x5
#define _MSEL3_FIL14_1_SIZE                                 0x1
#define _MSEL3_FIL14_1_LENGTH                               0x1
#define _MSEL3_FIL14_1_MASK                                 0x20
#define _MSEL3_FIL15_0_POSN                                 0x6
#define _MSEL3_FIL15_0_POSITION                             0x6
#define _MSEL3_FIL15_0_SIZE                                 0x1
#define _MSEL3_FIL15_0_LENGTH                               0x1
#define _MSEL3_FIL15_0_MASK                                 0x40
#define _MSEL3_FIL15_1_POSN                                 0x7
#define _MSEL3_FIL15_1_POSITION                             0x7
#define _MSEL3_FIL15_1_SIZE                                 0x1
#define _MSEL3_FIL15_1_LENGTH                               0x1
#define _MSEL3_FIL15_1_MASK                                 0x80

