MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K80/mcu.h
extern volatile RXF3EIDLbits_t RXF3EIDLbits __at(0xEEF);
// bitfield macros
#define _RXF3EIDL_EID_POSN                                  0x0
#define _RXF3EIDL_EID_POSITION                              0x0
#define _RXF3EIDL_EID_SIZE                                  0x8
#define _RXF3EIDL_EID_LENGTH                                0x8
#define _RXF3EIDL_EID_MASK                                  0xFF
#define _RXF3EIDL_EID0_POSN                                 0x0
#define _RXF3EIDL_EID0_POSITION                             0x0
#define _RXF3EIDL_EID0_SIZE                                 0x1
#define _RXF3EIDL_EID0_LENGTH                               0x1
#define _RXF3EIDL_EID0_MASK                                 0x1
#define _RXF3EIDL_EID1_POSN                                 0x1
#define _RXF3EIDL_EID1_POSITION                             0x1
#define _RXF3EIDL_EID1_SIZE                                 0x1
#define _RXF3EIDL_EID1_LENGTH                               0x1
#define _RXF3EIDL_EID1_MASK                                 0x2
#define _RXF3EIDL_EID2_POSN                                 0x2
#define _RXF3EIDL_EID2_POSITION                             0x2
#define _RXF3EIDL_EID2_SIZE                                 0x1
#define _RXF3EIDL_EID2_LENGTH                               0x1
#define _RXF3EIDL_EID2_MASK                                 0x4
#define _RXF3EIDL_EID3_POSN                                 0x3
#define _RXF3EIDL_EID3_POSITION                             0x3
#define _RXF3EIDL_EID3_SIZE                                 0x1
#define _RXF3EIDL_EID3_LENGTH                               0x1
#define _RXF3EIDL_EID3_MASK                                 0x8
#define _RXF3EIDL_EID4_POSN                                 0x4
#define _RXF3EIDL_EID4_POSITION                             0x4
#define _RXF3EIDL_EID4_SIZE                                 0x1
#define _RXF3EIDL_EID4_LENGTH                               0x1
#define _RXF3EIDL_EID4_MASK                                 0x10
#define _RXF3EIDL_EID5_POSN                                 0x5
#define _RXF3EIDL_EID5_POSITION                             0x5
#define _RXF3EIDL_EID5_SIZE                                 0x1
#define _RXF3EIDL_EID5_LENGTH                               0x1
#define _RXF3EIDL_EID5_MASK                                 0x20
#define _RXF3EIDL_EID6_POSN                                 0x6
#define _RXF3EIDL_EID6_POSITION                             0x6
#define _RXF3EIDL_EID6_SIZE                                 0x1
#define _RXF3EIDL_EID6_LENGTH                               0x1
#define _RXF3EIDL_EID6_MASK                                 0x40
#define _RXF3EIDL_EID7_POSN                                 0x7
#define _RXF3EIDL_EID7_POSITION                             0x7
#define _RXF3EIDL_EID7_SIZE                                 0x1
#define _RXF3EIDL_EID7_LENGTH                               0x1
#define _RXF3EIDL_EID7_MASK                                 0x80
#define _RXF3EIDL_RXF3EID0_POSN                             0x0
#define _RXF3EIDL_RXF3EID0_POSITION                         0x0
#define _RXF3EIDL_RXF3EID0_SIZE                             0x1
#define _RXF3EIDL_RXF3EID0_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID0_MASK                             0x1
#define _RXF3EIDL_RXF3EID1_POSN                             0x1
#define _RXF3EIDL_RXF3EID1_POSITION                         0x1
#define _RXF3EIDL_RXF3EID1_SIZE                             0x1
#define _RXF3EIDL_RXF3EID1_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID1_MASK                             0x2
#define _RXF3EIDL_RXF3EID2_POSN                             0x2
#define _RXF3EIDL_RXF3EID2_POSITION                         0x2
#define _RXF3EIDL_RXF3EID2_SIZE                             0x1
#define _RXF3EIDL_RXF3EID2_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID2_MASK                             0x4
#define _RXF3EIDL_RXF3EID3_POSN                             0x3
#define _RXF3EIDL_RXF3EID3_POSITION                         0x3
#define _RXF3EIDL_RXF3EID3_SIZE                             0x1
#define _RXF3EIDL_RXF3EID3_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID3_MASK                             0x8
#define _RXF3EIDL_RXF3EID4_POSN                             0x4
#define _RXF3EIDL_RXF3EID4_POSITION                         0x4
#define _RXF3EIDL_RXF3EID4_SIZE                             0x1
#define _RXF3EIDL_RXF3EID4_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID4_MASK                             0x10
#define _RXF3EIDL_RXF3EID5_POSN                             0x5
#define _RXF3EIDL_RXF3EID5_POSITION                         0x5
#define _RXF3EIDL_RXF3EID5_SIZE                             0x1
#define _RXF3EIDL_RXF3EID5_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID5_MASK                             0x20
#define _RXF3EIDL_RXF3EID6_POSN                             0x6
#define _RXF3EIDL_RXF3EID6_POSITION                         0x6
#define _RXF3EIDL_RXF3EID6_SIZE                             0x1
#define _RXF3EIDL_RXF3EID6_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID6_MASK                             0x40
#define _RXF3EIDL_RXF3EID7_POSN                             0x7
#define _RXF3EIDL_RXF3EID7_POSITION                         0x7
#define _RXF3EIDL_RXF3EID7_SIZE                             0x1
#define _RXF3EIDL_RXF3EID7_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID7_MASK                             0x80

// Register: RXF4SIDH
#define RXF4SIDH RXF4SIDH
extern volatile unsigned char           RXF4SIDH            __at(0xEF0);
#ifndef _LIB_BUILD
asm("RXF4SIDH equ 0EF0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF4SID3               :1;
        unsigned RXF4SID4               :1;
        unsigned RXF4SID5               :1;
        unsigned RXF4SID6               :1;
        unsigned RXF4SID7               :1;
        unsigned RXF4SID8               :1;
        unsigned RXF4SID9               :1;
        unsigned RXF4SID10              :1;
    };
} RXF4SIDHbits_t;
extern volatile RXF4SIDHbits_t RXF4SIDHbits __at(0xEF0);
// bitfield macros
#define _RXF4SIDH_SID_POSN                                  0x0
#define _RXF4SIDH_SID_POSITION                              0x0
#define _RXF4SIDH_SID_SIZE                                  0x8
#define _RXF4SIDH_SID_LENGTH                                0x8
#define _RXF4SIDH_SID_MASK                                  0xFF
#define _RXF4SIDH_SID3_POSN                                 0x0
#define _RXF4SIDH_SID3_POSITION                             0x0
#define _RXF4SIDH_SID3_SIZE                                 0x1
#define _RXF4SIDH_SID3_LENGTH                               0x1
#define _RXF4SIDH_SID3_MASK                                 0x1
#define _RXF4SIDH_SID4_POSN                                 0x1
#define _RXF4SIDH_SID4_POSITION                             0x1
#define _RXF4SIDH_SID4_SIZE                                 0x1
#define _RXF4SIDH_SID4_LENGTH                               0x1
#define _RXF4SIDH_SID4_MASK                                 0x2
#define _RXF4SIDH_SID5_POSN                                 0x2
#define _RXF4SIDH_SID5_POSITION                             0x2
#define _RXF4SIDH_SID5_SIZE                                 0x1
#define _RXF4SIDH_SID5_LENGTH                               0x1
#define _RXF4SIDH_SID5_MASK                                 0x4
#define _RXF4SIDH_SID6_POSN                                 0x3
#define _RXF4SIDH_SID6_POSITION                             0x3
#define _RXF4SIDH_SID6_SIZE                                 0x1
#define _RXF4SIDH_SID6_LENGTH                               0x1
#define _RXF4SIDH_SID6_MASK                                 0x8
#define _RXF4SIDH_SID7_POSN                                 0x4
#define _RXF4SIDH_SID7_POSITION                             0x4
#define _RXF4SIDH_SID7_SIZE                                 0x1
#define _RXF4SIDH_SID7_LENGTH                               0x1
#define _RXF4SIDH_SID7_MASK                                 0x10
#define _RXF4SIDH_SID8_POSN                                 0x5
#define _RXF4SIDH_SID8_POSITION                             0x5
#define _RXF4SIDH_SID8_SIZE                                 0x1
#define _RXF4SIDH_SID8_LENGTH                               0x1
#define _RXF4SIDH_SID8_MASK                                 0x20
#define _RXF4SIDH_SID9_POSN                                 0x6
#define _RXF4SIDH_SID9_POSITION                             0x6
#define _RXF4SIDH_SID9_SIZE                                 0x1
#define _RXF4SIDH_SID9_LENGTH                               0x1
#define _RXF4SIDH_SID9_MASK                                 0x40
#define _RXF4SIDH_SID10_POSN                                0x7
#define _RXF4SIDH_SID10_POSITION                            0x7
#define _RXF4SIDH_SID10_SIZE                                0x1
#define _RXF4SIDH_SID10_LENGTH                              0x1
#define _RXF4SIDH_SID10_MASK                                0x80
#define _RXF4SIDH_RXF4SID3_POSN                             0x0
#define _RXF4SIDH_RXF4SID3_POSITION                         0x0
#define _RXF4SIDH_RXF4SID3_SIZE                             0x1
#define _RXF4SIDH_RXF4SID3_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID3_MASK                             0x1
#define _RXF4SIDH_RXF4SID4_POSN                             0x1
#define _RXF4SIDH_RXF4SID4_POSITION                         0x1
#define _RXF4SIDH_RXF4SID4_SIZE                             0x1
#define _RXF4SIDH_RXF4SID4_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID4_MASK                             0x2
#define _RXF4SIDH_RXF4SID5_POSN                             0x2
#define _RXF4SIDH_RXF4SID5_POSITION                         0x2
#define _RXF4SIDH_RXF4SID5_SIZE                             0x1
#define _RXF4SIDH_RXF4SID5_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID5_MASK                             0x4
#define _RXF4SIDH_RXF4SID6_POSN                             0x3
#define _RXF4SIDH_RXF4SID6_POSITION                         0x3
#define _RXF4SIDH_RXF4SID6_SIZE                             0x1
#define _RXF4SIDH_RXF4SID6_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID6_MASK                             0x8
#define _RXF4SIDH_RXF4SID7_POSN                             0x4
#define _RXF4SIDH_RXF4SID7_POSITION                         0x4
#define _RXF4SIDH_RXF4SID7_SIZE                             0x1
#define _RXF4SIDH_RXF4SID7_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID7_MASK                             0x10
#define _RXF4SIDH_RXF4SID8_POSN                             0x5
#define _RXF4SIDH_RXF4SID8_POSITION                         0x5
#define _RXF4SIDH_RXF4SID8_SIZE                             0x1
#define _RXF4SIDH_RXF4SID8_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID8_MASK                             0x20
#define _RXF4SIDH_RXF4SID9_POSN                             0x6
#define _RXF4SIDH_RXF4SID9_POSITION                         0x6
#define _RXF4SIDH_RXF4SID9_SIZE                             0x1
#define _RXF4SIDH_RXF4SID9_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID9_MASK                             0x40
#define _RXF4SIDH_RXF4SID10_POSN                            0x7
#define _RXF4SIDH_RXF4SID10_POSITION                        0x7
#define _RXF4SIDH_RXF4SID10_SIZE                            0x1
#define _RXF4SIDH_RXF4SID10_LENGTH                          0x1
#define _RXF4SIDH_RXF4SID10_MASK                            0x80

// Register: RXF4SIDL
#define RXF4SIDL RXF4SIDL
extern volatile unsigned char           RXF4SIDL            __at(0xEF1);
#ifndef _LIB_BUILD
asm("RXF4SIDL equ 0EF1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF4EID16              :1;
        unsigned RXF4EID17              :1;
        unsigned                        :1;
        unsigned RXF4EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF4SID0               :1;
        unsigned RXF4SID1               :1;
        unsigned RXF4SID2               :1;
    };
} RXF4SIDLbits_t;
extern volatile RXF4SIDLbits_t RXF4SIDLbits __at(0xEF1);
// bitfield macros
#define _RXF4SIDL_EID_POSN                                  0x0
#define _RXF4SIDL_EID_POSITION                              0x0
#define _RXF4SIDL_EID_SIZE                                  0x2
#define _RXF4SIDL_EID_LENGTH                                0x2
#define _RXF4SIDL_EID_MASK                                  0x3
#define _RXF4SIDL_EXIDEN_POSN                               0x3
#define _RXF4SIDL_EXIDEN_POSITION                           0x3
#define _RXF4SIDL_EXIDEN_SIZE                               0x1
#define _RXF4SIDL_EXIDEN_LENGTH                             0x1
#define _RXF4SIDL_EXIDEN_MASK                               0x8
#define _RXF4SIDL_SID_POSN                                  0x5
#define _RXF4SIDL_SID_POSITION                              0x5
#define _RXF4SIDL_SID_SIZE                                  0x3
#define _RXF4SIDL_SID_LENGTH                                0x3
#define _RXF4SIDL_SID_MASK                                  0xE0
#define _RXF4SIDL_EID16_POSN                                0x0
#define _RXF4SIDL_EID16_POSITION                            0x0
#define _RXF4SIDL_EID16_SIZE                                0x1
#define _RXF4SIDL_EID16_LENGTH                              0x1
#define _RXF4SIDL_EID16_MASK                                0x1
#define _RXF4SIDL_EID17_POSN                                0x1
#define _RXF4SIDL_EID17_POSITION                            0x1
#define _RXF4SIDL_EID17_SIZE                                0x1
#define _RXF4SIDL_EID17_LENGTH                              0x1
#define _RXF4SIDL_EID17_MASK                                0x2
#define _RXF4SIDL_SID0_POSN                                 0x5
#define _RXF4SIDL_SID0_POSITION                             0x5
#define _RXF4SIDL_SID0_SIZE                                 0x1
#define _RXF4SIDL_SID0_LENGTH                               0x1
#define _RXF4SIDL_SID0_MASK                                 0x20
#define _RXF4SIDL_SID1_POSN                                 0x6
#define _RXF4SIDL_SID1_POSITION                             0x6
#define _RXF4SIDL_SID1_SIZE                                 0x1
#define _RXF4SIDL_SID1_LENGTH                               0x1
#define _RXF4SIDL_SID1_MASK                                 0x40
#define _RXF4SIDL_SID2_POSN                                 0x7
#define _RXF4SIDL_SID2_POSITION                             0x7
#define _RXF4SIDL_SID2_SIZE                                 0x1
#define _RXF4SIDL_SID2_LENGTH                               0x1
#define _RXF4SIDL_SID2_MASK                                 0x80
#define _RXF4SIDL_RXF4EID16_POSN                            0x0
#define _RXF4SIDL_RXF4EID16_POSITION                        0x0
#define _RXF4SIDL_RXF4EID16_SIZE                            0x1
#define _RXF4SIDL_RXF4EID16_LENGTH                          0x1
#define _RXF4SIDL_RXF4EID16_MASK                            0x1
#define _RXF4SIDL_RXF4EID17_POSN                            0x1
#define _RXF4SIDL_RXF4EID17_POSITION                        0x1
#define _RXF4SIDL_RXF4EID17_SIZE                            0x1
#define _RXF4SIDL_RXF4EID17_LENGTH                          0x1
#define _RXF4SIDL_RXF4EID17_MASK                            0x2
#define _RXF4SIDL_RXF4EXIDEN_POSN                           0x3
#define _RXF4SIDL_RXF4EXIDEN_POSITION                       0x3
#define _RXF4SIDL_RXF4EXIDEN_SIZE                           0x1
#define _RXF4SIDL_RXF4EXIDEN_LENGTH                         0x1
#define _RXF4SIDL_RXF4EXIDEN_MASK                           0x8
#define _RXF4SIDL_RXF4SID0_POSN                             0x5
#define _RXF4SIDL_RXF4SID0_POSITION                         0x5
#define _RXF4SIDL_RXF4SID0_SIZE                             0x1
#define _RXF4SIDL_RXF4SID0_LENGTH                           0x1
#define _RXF4SIDL_RXF4SID0_MASK                             0x20
#define _RXF4SIDL_RXF4SID1_POSN                             0x6
#define _RXF4SIDL_RXF4SID1_POSITION                         0x6
#define _RXF4SIDL_RXF4SID1_SIZE                             0x1
#define _RXF4SIDL_RXF4SID1_LENGTH                           0x1
#define _RXF4SIDL_RXF4SID1_MASK                             0x40
#define _RXF4SIDL_RXF4SID2_POSN                             0x7
#define _RXF4SIDL_RXF4SID2_POSITION                         0x7
#define _RXF4SIDL_RXF4SID2_SIZE                             0x1
#define _RXF4SIDL_RXF4SID2_LENGTH                           0x1
#define _RXF4SIDL_RXF4SID2_MASK                             0x80

// Register: RXF4EIDH
#define RXF4EIDH RXF4EIDH
extern volatile unsigned char           RXF4EIDH            __at(0xEF2);
#ifndef _LIB_BUILD
asm("RXF4EIDH equ 0EF2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF4EID8               :1;
        unsigned RXF4EID9               :1;
        unsigned RXF4EID10              :1;
        unsigned RXF4EID11              :1;
        unsigned RXF4EID12              :1;
        unsigned RXF4EID13              :1;
        unsigned RXF4EID14              :1;
        unsigned RXF4EID15              :1;
    };
} RXF4EIDHbits_t;
