MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K80/mcu.h
// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0xFFD);
#ifndef _LIB_BUILD
asm("TOSL equ 0FFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSL                   :8;
    };
} TOSLbits_t;
extern volatile TOSLbits_t TOSLbits __at(0xFFD);
// bitfield macros
#define _TOSL_TOSL_POSN                                     0x0
#define _TOSL_TOSL_POSITION                                 0x0
#define _TOSL_TOSL_SIZE                                     0x8
#define _TOSL_TOSL_LENGTH                                   0x8
#define _TOSL_TOSL_MASK                                     0xFF

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0xFFE);
#ifndef _LIB_BUILD
asm("TOSH equ 0FFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSH                   :8;
    };
} TOSHbits_t;
extern volatile TOSHbits_t TOSHbits __at(0xFFE);
// bitfield macros
#define _TOSH_TOSH_POSN                                     0x0
#define _TOSH_TOSH_POSITION                                 0x0
#define _TOSH_TOSH_SIZE                                     0x8
#define _TOSH_TOSH_LENGTH                                   0x8
#define _TOSH_TOSH_MASK                                     0xFF

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0xFFF);
#ifndef _LIB_BUILD
asm("TOSU equ 0FFFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSU                   :5;
    };
} TOSUbits_t;
extern volatile TOSUbits_t TOSUbits __at(0xFFF);
// bitfield macros
#define _TOSU_TOSU_POSN                                     0x0
#define _TOSU_TOSU_POSITION                                 0x0
#define _TOSU_TOSU_SIZE                                     0x5
#define _TOSU_TOSU_LENGTH                                   0x5
#define _TOSU_TOSU_MASK                                     0x1F

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// BAUDCON1<ABDEN1>
extern volatile __bit                   ABDEN1              __at(0x7D38);	// @ (0xFA7 * 8 + 0)
#define                                 ABDEN1_bit          _BIT_ACCESS(BAUDCON1,0)
// BAUDCON2<ABDEN2>
extern volatile __bit                   ABDEN2              __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 ABDEN2_bit          _BIT_ACCESS(BAUDCON2,0)
// BAUDCON1<ABDOVF1>
extern volatile __bit                   ABDOVF1             __at(0x7D3F);	// @ (0xFA7 * 8 + 7)
#define                                 ABDOVF1_bit         _BIT_ACCESS(BAUDCON1,7)
// BAUDCON2<ABDOVF2>
extern volatile __bit                   ABDOVF2             __at(0x7DCF);	// @ (0xFB9 * 8 + 7)
#define                                 ABDOVF2_bit         _BIT_ACCESS(BAUDCON2,7)
// SSPCON2<ACKDT>
extern volatile __bit                   ACKDT               __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ACKDT_bit           _BIT_ACCESS(SSPCON2,5)
// SSPCON2<ACKEN>
extern volatile __bit                   ACKEN               __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ACKEN_bit           _BIT_ACCESS(SSPCON2,4)
// SSPCON2<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0x7E2E);	// @ (0xFC5 * 8 + 6)
#define                                 ACKSTAT_bit         _BIT_ACCESS(SSPCON2,6)
// ADCON2<ACQT0>
extern volatile __bit                   ACQT0               __at(0x7E03);	// @ (0xFC0 * 8 + 3)
#define                                 ACQT0_bit           _BIT_ACCESS(ADCON2,3)
// ADCON2<ACQT1>
extern volatile __bit                   ACQT1               __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 ACQT1_bit           _BIT_ACCESS(ADCON2,4)
// ADCON2<ACQT2>
extern volatile __bit                   ACQT2               __at(0x7E05);	// @ (0xFC0 * 8 + 5)
#define                                 ACQT2_bit           _BIT_ACCESS(ADCON2,5)
// PMD1<ADCMD>
extern volatile __bit                   ADCMD               __at(0x7AC5);	// @ (0xF58 * 8 + 5)
#define                                 ADCMD_bit           _BIT_ACCESS(PMD1,5)
// ADCON2<ADCS0>
extern volatile __bit                   ADCS0               __at(0x7E00);	// @ (0xFC0 * 8 + 0)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON2,0)
// ADCON2<ADCS1>
extern volatile __bit                   ADCS1               __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON2,1)
// ADCON2<ADCS2>
extern volatile __bit                   ADCS2               __at(0x7E02);	// @ (0xFC0 * 8 + 2)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON2,2)
// RCSTA1<ADDEN1>
extern volatile __bit                   ADDEN1              __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADDEN1_bit          _BIT_ACCESS(RCSTA1,3)
// RCSTA2<ADDEN2>
extern volatile __bit                   ADDEN2              __at(0x7D33);	// @ (0xFA6 * 8 + 3)
#define                                 ADDEN2_bit          _BIT_ACCESS(RCSTA2,3)
// RCSTA1<ADEN>
extern volatile __bit                   ADEN                __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADEN_bit            _BIT_ACCESS(RCSTA1,3)
// ADCON2<ADFM>
extern volatile __bit                   ADFM                __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON2,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// IPR1<ADIP>
extern volatile __bit                   ADIP                __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 ADIP_bit            _BIT_ACCESS(IPR1,6)
// SSPCON2<ADMSK1>
extern volatile __bit                   ADMSK1              __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 ADMSK1_bit          _BIT_ACCESS(SSPCON2,1)
// SSPCON2<ADMSK2>
extern volatile __bit                   ADMSK2              __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 ADMSK2_bit          _BIT_ACCESS(SSPCON2,2)
// SSPCON2<ADMSK3>
extern volatile __bit                   ADMSK3              __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 ADMSK3_bit          _BIT_ACCESS(SSPCON2,3)
// SSPCON2<ADMSK4>
extern volatile __bit                   ADMSK4              __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ADMSK4_bit          _BIT_ACCESS(SSPCON2,4)
// SSPCON2<ADMSK5>
extern volatile __bit                   ADMSK5              __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ADMSK5_bit          _BIT_ACCESS(SSPCON2,5)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ANCON0<ANSEL0>
extern volatile __bit                   ANSEL0              __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 ANSEL0_bit          _BIT_ACCESS(ANCON0,0)
// ANCON0<ANSEL1>
extern volatile __bit                   ANSEL1              __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 ANSEL1_bit          _BIT_ACCESS(ANCON0,1)
// ANCON1<ANSEL10>
extern volatile __bit                   ANSEL10             __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 ANSEL10_bit         _BIT_ACCESS(ANCON1,2)
// ANCON1<ANSEL11>
extern volatile __bit                   ANSEL11             __at(0x7AE3);	// @ (0xF5C * 8 + 3)
#define                                 ANSEL11_bit         _BIT_ACCESS(ANCON1,3)
// ANCON1<ANSEL12>
extern volatile __bit                   ANSEL12             __at(0x7AE4);	// @ (0xF5C * 8 + 4)
#define                                 ANSEL12_bit         _BIT_ACCESS(ANCON1,4)
// ANCON1<ANSEL13>
extern volatile __bit                   ANSEL13             __at(0x7AE5);	// @ (0xF5C * 8 + 5)
#define                                 ANSEL13_bit         _BIT_ACCESS(ANCON1,5)
// ANCON1<ANSEL14>
extern volatile __bit                   ANSEL14             __at(0x7AE6);	// @ (0xF5C * 8 + 6)
#define                                 ANSEL14_bit         _BIT_ACCESS(ANCON1,6)
// ANCON0<ANSEL2>
extern volatile __bit                   ANSEL2              __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 ANSEL2_bit          _BIT_ACCESS(ANCON0,2)
// ANCON0<ANSEL3>
extern volatile __bit                   ANSEL3              __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 ANSEL3_bit          _BIT_ACCESS(ANCON0,3)
// ANCON0<ANSEL4>
extern volatile __bit                   ANSEL4              __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 ANSEL4_bit          _BIT_ACCESS(ANCON0,4)
// ANCON0<ANSEL5>
extern volatile __bit                   ANSEL5              __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 ANSEL5_bit          _BIT_ACCESS(ANCON0,5)
// ANCON0<ANSEL6>
extern volatile __bit                   ANSEL6              __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 ANSEL6_bit          _BIT_ACCESS(ANCON0,6)
// ANCON0<ANSEL7>
extern volatile __bit                   ANSEL7              __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 ANSEL7_bit          _BIT_ACCESS(ANCON0,7)
// ANCON1<ANSEL8>
extern volatile __bit                   ANSEL8              __at(0x7AE0);	// @ (0xF5C * 8 + 0)
#define                                 ANSEL8_bit          _BIT_ACCESS(ANCON1,0)
// ANCON1<ANSEL9>
extern volatile __bit                   ANSEL9              __at(0x7AE1);	// @ (0xF5C * 8 + 1)
#define                                 ANSEL9_bit          _BIT_ACCESS(ANCON1,1)
// B0D0<B0D00>
extern volatile __bit                   B0D00               __at(0x7430);	// @ (0xE86 * 8 + 0)
#define                                 B0D00_bit           _BIT_ACCESS(B0D0,0)
// B0D0<B0D01>
extern volatile __bit                   B0D01               __at(0x7431);	// @ (0xE86 * 8 + 1)
#define                                 B0D01_bit           _BIT_ACCESS(B0D0,1)
// B0D0<B0D02>
extern volatile __bit                   B0D02               __at(0x7432);	// @ (0xE86 * 8 + 2)
#define                                 B0D02_bit           _BIT_ACCESS(B0D0,2)
// B0D0<B0D03>
extern volatile __bit                   B0D03               __at(0x7433);	// @ (0xE86 * 8 + 3)
#define                                 B0D03_bit           _BIT_ACCESS(B0D0,3)
// B0D0<B0D04>
extern volatile __bit                   B0D04               __at(0x7434);	// @ (0xE86 * 8 + 4)
#define                                 B0D04_bit           _BIT_ACCESS(B0D0,4)
// B0D0<B0D05>
extern volatile __bit                   B0D05               __at(0x7435);	// @ (0xE86 * 8 + 5)
#define                                 B0D05_bit           _BIT_ACCESS(B0D0,5)
// B0D0<B0D06>
extern volatile __bit                   B0D06               __at(0x7436);	// @ (0xE86 * 8 + 6)
#define                                 B0D06_bit           _BIT_ACCESS(B0D0,6)
// B0D0<B0D07>
extern volatile __bit                   B0D07               __at(0x7437);	// @ (0xE86 * 8 + 7)
#define                                 B0D07_bit           _BIT_ACCESS(B0D0,7)
// B0D1<B0D10>
extern volatile __bit                   B0D10               __at(0x7438);	// @ (0xE87 * 8 + 0)
#define                                 B0D10_bit           _BIT_ACCESS(B0D1,0)
// B0D1<B0D11>
extern volatile __bit                   B0D11               __at(0x7439);	// @ (0xE87 * 8 + 1)
#define                                 B0D11_bit           _BIT_ACCESS(B0D1,1)
// B0D1<B0D12>
extern volatile __bit                   B0D12               __at(0x743A);	// @ (0xE87 * 8 + 2)
#define                                 B0D12_bit           _BIT_ACCESS(B0D1,2)
// B0D1<B0D13>
extern volatile __bit                   B0D13               __at(0x743B);	// @ (0xE87 * 8 + 3)
#define                                 B0D13_bit           _BIT_ACCESS(B0D1,3)
// B0D1<B0D14>
extern volatile __bit                   B0D14               __at(0x743C);	// @ (0xE87 * 8 + 4)
#define                                 B0D14_bit           _BIT_ACCESS(B0D1,4)
// B0D1<B0D15>
extern volatile __bit                   B0D15               __at(0x743D);	// @ (0xE87 * 8 + 5)
#define                                 B0D15_bit           _BIT_ACCESS(B0D1,5)
// B0D1<B0D16>
extern volatile __bit                   B0D16               __at(0x743E);	// @ (0xE87 * 8 + 6)
#define                                 B0D16_bit           _BIT_ACCESS(B0D1,6)
// B0D1<B0D17>
extern volatile __bit                   B0D17               __at(0x743F);	// @ (0xE87 * 8 + 7)
#define                                 B0D17_bit           _BIT_ACCESS(B0D1,7)
// B0D2<B0D20>
extern volatile __bit                   B0D20               __at(0x7440);	// @ (0xE88 * 8 + 0)
#define                                 B0D20_bit           _BIT_ACCESS(B0D2,0)
// B0D2<B0D21>
extern volatile __bit                   B0D21               __at(0x7441);	// @ (0xE88 * 8 + 1)
#define                                 B0D21_bit           _BIT_ACCESS(B0D2,1)
// B0D2<B0D22>
extern volatile __bit                   B0D22               __at(0x7442);	// @ (0xE88 * 8 + 2)
#define                                 B0D22_bit           _BIT_ACCESS(B0D2,2)
// B0D2<B0D23>
extern volatile __bit                   B0D23               __at(0x7443);	// @ (0xE88 * 8 + 3)
#define                                 B0D23_bit           _BIT_ACCESS(B0D2,3)
// B0D2<B0D24>
extern volatile __bit                   B0D24               __at(0x7444);	// @ (0xE88 * 8 + 4)
#define                                 B0D24_bit           _BIT_ACCESS(B0D2,4)
// B0D2<B0D25>
extern volatile __bit                   B0D25               __at(0x7445);	// @ (0xE88 * 8 + 5)
#define                                 B0D25_bit           _BIT_ACCESS(B0D2,5)
// B0D2<B0D26>
extern volatile __bit                   B0D26               __at(0x7446);	// @ (0xE88 * 8 + 6)
#define                                 B0D26_bit           _BIT_ACCESS(B0D2,6)
// B0D2<B0D27>
extern volatile __bit                   B0D27               __at(0x7447);	// @ (0xE88 * 8 + 7)
#define                                 B0D27_bit           _BIT_ACCESS(B0D2,7)
// B0D3<B0D30>
extern volatile __bit                   B0D30               __at(0x7448);	// @ (0xE89 * 8 + 0)
#define                                 B0D30_bit           _BIT_ACCESS(B0D3,0)
// B0D3<B0D31>
extern volatile __bit                   B0D31               __at(0x7449);	// @ (0xE89 * 8 + 1)
#define                                 B0D31_bit           _BIT_ACCESS(B0D3,1)
// B0D3<B0D32>
extern volatile __bit                   B0D32               __at(0x744A);	// @ (0xE89 * 8 + 2)
#define                                 B0D32_bit           _BIT_ACCESS(B0D3,2)
// B0D3<B0D33>
extern volatile __bit                   B0D33               __at(0x744B);	// @ (0xE89 * 8 + 3)
#define                                 B0D33_bit           _BIT_ACCESS(B0D3,3)
// B0D3<B0D34>
extern volatile __bit                   B0D34               __at(0x744C);	// @ (0xE89 * 8 + 4)
#define                                 B0D34_bit           _BIT_ACCESS(B0D3,4)
// B0D3<B0D35>
extern volatile __bit                   B0D35               __at(0x744D);	// @ (0xE89 * 8 + 5)
#define                                 B0D35_bit           _BIT_ACCESS(B0D3,5)
// B0D3<B0D36>
extern volatile __bit                   B0D36               __at(0x744E);	// @ (0xE89 * 8 + 6)
#define                                 B0D36_bit           _BIT_ACCESS(B0D3,6)
// B0D3<B0D37>
extern volatile __bit                   B0D37               __at(0x744F);	// @ (0xE89 * 8 + 7)
#define                                 B0D37_bit           _BIT_ACCESS(B0D3,7)
// B0D4<B0D40>
extern volatile __bit                   B0D40               __at(0x7450);	// @ (0xE8A * 8 + 0)
#define                                 B0D40_bit           _BIT_ACCESS(B0D4,0)
// B0D4<B0D41>
extern volatile __bit                   B0D41               __at(0x7451);	// @ (0xE8A * 8 + 1)
#define                                 B0D41_bit           _BIT_ACCESS(B0D4,1)
// B0D4<B0D42>
extern volatile __bit                   B0D42               __at(0x7452);	// @ (0xE8A * 8 + 2)
#define                                 B0D42_bit           _BIT_ACCESS(B0D4,2)
// B0D4<B0D43>
extern volatile __bit                   B0D43               __at(0x7453);	// @ (0xE8A * 8 + 3)
#define                                 B0D43_bit           _BIT_ACCESS(B0D4,3)
// B0D4<B0D44>
extern volatile __bit                   B0D44               __at(0x7454);	// @ (0xE8A * 8 + 4)
#define                                 B0D44_bit           _BIT_ACCESS(B0D4,4)
// B0D4<B0D45>
extern volatile __bit                   B0D45               __at(0x7455);	// @ (0xE8A * 8 + 5)
#define                                 B0D45_bit           _BIT_ACCESS(B0D4,5)
// B0D4<B0D46>
extern volatile __bit                   B0D46               __at(0x7456);	// @ (0xE8A * 8 + 6)
#define                                 B0D46_bit           _BIT_ACCESS(B0D4,6)
// B0D4<B0D47>
extern volatile __bit                   B0D47               __at(0x7457);	// @ (0xE8A * 8 + 7)
#define                                 B0D47_bit           _BIT_ACCESS(B0D4,7)
// B0D5<B0D50>
extern volatile __bit                   B0D50               __at(0x7458);	// @ (0xE8B * 8 + 0)
#define                                 B0D50_bit           _BIT_ACCESS(B0D5,0)
// B0D5<B0D51>
extern volatile __bit                   B0D51               __at(0x7459);	// @ (0xE8B * 8 + 1)
#define                                 B0D51_bit           _BIT_ACCESS(B0D5,1)
// B0D5<B0D52>
extern volatile __bit                   B0D52               __at(0x745A);	// @ (0xE8B * 8 + 2)
#define                                 B0D52_bit           _BIT_ACCESS(B0D5,2)
// B0D5<B0D53>
extern volatile __bit                   B0D53               __at(0x745B);	// @ (0xE8B * 8 + 3)
#define                                 B0D53_bit           _BIT_ACCESS(B0D5,3)
// B0D5<B0D54>
extern volatile __bit                   B0D54               __at(0x745C);	// @ (0xE8B * 8 + 4)
#define                                 B0D54_bit           _BIT_ACCESS(B0D5,4)
// B0D5<B0D55>
extern volatile __bit                   B0D55               __at(0x745D);	// @ (0xE8B * 8 + 5)
#define                                 B0D55_bit           _BIT_ACCESS(B0D5,5)
// B0D5<B0D56>
extern volatile __bit                   B0D56               __at(0x745E);	// @ (0xE8B * 8 + 6)
#define                                 B0D56_bit           _BIT_ACCESS(B0D5,6)
// B0D5<B0D57>
extern volatile __bit                   B0D57               __at(0x745F);	// @ (0xE8B * 8 + 7)
#define                                 B0D57_bit           _BIT_ACCESS(B0D5,7)
// B0D6<B0D60>
extern volatile __bit                   B0D60               __at(0x7460);	// @ (0xE8C * 8 + 0)
#define                                 B0D60_bit           _BIT_ACCESS(B0D6,0)
// B0D6<B0D61>
extern volatile __bit                   B0D61               __at(0x7461);	// @ (0xE8C * 8 + 1)
#define                                 B0D61_bit           _BIT_ACCESS(B0D6,1)
// B0D6<B0D62>
extern volatile __bit                   B0D62               __at(0x7462);	// @ (0xE8C * 8 + 2)
#define                                 B0D62_bit           _BIT_ACCESS(B0D6,2)
// B0D6<B0D63>
extern volatile __bit                   B0D63               __at(0x7463);	// @ (0xE8C * 8 + 3)
#define                                 B0D63_bit           _BIT_ACCESS(B0D6,3)
// B0D6<B0D64>
extern volatile __bit                   B0D64               __at(0x7464);	// @ (0xE8C * 8 + 4)
#define                                 B0D64_bit           _BIT_ACCESS(B0D6,4)
// B0D6<B0D65>
extern volatile __bit                   B0D65               __at(0x7465);	// @ (0xE8C * 8 + 5)
#define                                 B0D65_bit           _BIT_ACCESS(B0D6,5)
// B0D6<B0D66>
extern volatile __bit                   B0D66               __at(0x7466);	// @ (0xE8C * 8 + 6)
#define                                 B0D66_bit           _BIT_ACCESS(B0D6,6)
// B0D6<B0D67>
extern volatile __bit                   B0D67               __at(0x7467);	// @ (0xE8C * 8 + 7)
#define                                 B0D67_bit           _BIT_ACCESS(B0D6,7)
// B0D7<B0D70>
extern volatile __bit                   B0D70               __at(0x7468);	// @ (0xE8D * 8 + 0)
#define                                 B0D70_bit           _BIT_ACCESS(B0D7,0)
// B0D7<B0D71>
extern volatile __bit                   B0D71               __at(0x7469);	// @ (0xE8D * 8 + 1)
#define                                 B0D71_bit           _BIT_ACCESS(B0D7,1)
// B0D7<B0D72>
extern volatile __bit                   B0D72               __at(0x746A);	// @ (0xE8D * 8 + 2)
#define                                 B0D72_bit           _BIT_ACCESS(B0D7,2)
// B0D7<B0D73>
extern volatile __bit                   B0D73               __at(0x746B);	// @ (0xE8D * 8 + 3)
#define                                 B0D73_bit           _BIT_ACCESS(B0D7,3)
// B0D7<B0D74>
extern volatile __bit                   B0D74               __at(0x746C);	// @ (0xE8D * 8 + 4)
#define                                 B0D74_bit           _BIT_ACCESS(B0D7,4)
// B0D7<B0D75>
extern volatile __bit                   B0D75               __at(0x746D);	// @ (0xE8D * 8 + 5)
#define                                 B0D75_bit           _BIT_ACCESS(B0D7,5)
// B0D7<B0D76>
extern volatile __bit                   B0D76               __at(0x746E);	// @ (0xE8D * 8 + 6)
#define                                 B0D76_bit           _BIT_ACCESS(B0D7,6)
// B0D7<B0D77>
extern volatile __bit                   B0D77               __at(0x746F);	// @ (0xE8D * 8 + 7)
#define                                 B0D77_bit           _BIT_ACCESS(B0D7,7)
// B0DLC<B0DLC0>
extern volatile __bit                   B0DLC0              __at(0x7428);	// @ (0xE85 * 8 + 0)
#define                                 B0DLC0_bit          _BIT_ACCESS(B0DLC,0)
// B0DLC<B0DLC1>
extern volatile __bit                   B0DLC1              __at(0x7429);	// @ (0xE85 * 8 + 1)
#define                                 B0DLC1_bit          _BIT_ACCESS(B0DLC,1)
// B0DLC<B0DLC2>
extern volatile __bit                   B0DLC2              __at(0x742A);	// @ (0xE85 * 8 + 2)
#define                                 B0DLC2_bit          _BIT_ACCESS(B0DLC,2)
// B0DLC<B0DLC3>
extern volatile __bit                   B0DLC3              __at(0x742B);	// @ (0xE85 * 8 + 3)
#define                                 B0DLC3_bit          _BIT_ACCESS(B0DLC,3)
// B0EIDL<B0EID0>
extern volatile __bit                   B0EID0              __at(0x7420);	// @ (0xE84 * 8 + 0)
#define                                 B0EID0_bit          _BIT_ACCESS(B0EIDL,0)
// B0EIDL<B0EID1>
extern volatile __bit                   B0EID1              __at(0x7421);	// @ (0xE84 * 8 + 1)
#define                                 B0EID1_bit          _BIT_ACCESS(B0EIDL,1)
// B0EIDH<B0EID10>
extern volatile __bit                   B0EID10             __at(0x741A);	// @ (0xE83 * 8 + 2)
#define                                 B0EID10_bit         _BIT_ACCESS(B0EIDH,2)
// B0EIDH<B0EID11>
