MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K80/mcu.h
extern volatile __bit                   B2EID4              __at(0x7524);	// @ (0xEA4 * 8 + 4)
#define                                 B2EID4_bit          _BIT_ACCESS(B2EIDL,4)
// B2EIDL<B2EID5>
extern volatile __bit                   B2EID5              __at(0x7525);	// @ (0xEA4 * 8 + 5)
#define                                 B2EID5_bit          _BIT_ACCESS(B2EIDL,5)
// B2EIDL<B2EID6>
extern volatile __bit                   B2EID6              __at(0x7526);	// @ (0xEA4 * 8 + 6)
#define                                 B2EID6_bit          _BIT_ACCESS(B2EIDL,6)
// B2EIDL<B2EID7>
extern volatile __bit                   B2EID7              __at(0x7527);	// @ (0xEA4 * 8 + 7)
#define                                 B2EID7_bit          _BIT_ACCESS(B2EIDL,7)
// B2EIDH<B2EID8>
extern volatile __bit                   B2EID8              __at(0x7518);	// @ (0xEA3 * 8 + 0)
#define                                 B2EID8_bit          _BIT_ACCESS(B2EIDH,0)
// B2EIDH<B2EID9>
extern volatile __bit                   B2EID9              __at(0x7519);	// @ (0xEA3 * 8 + 1)
#define                                 B2EID9_bit          _BIT_ACCESS(B2EIDH,1)
// B2SIDL<B2EXID>
extern volatile __bit                   B2EXID              __at(0x7513);	// @ (0xEA2 * 8 + 3)
#define                                 B2EXID_bit          _BIT_ACCESS(B2SIDL,3)
// B2SIDL<B2EXIDE>
extern volatile __bit                   B2EXIDE             __at(0x7513);	// @ (0xEA2 * 8 + 3)
#define                                 B2EXIDE_bit         _BIT_ACCESS(B2SIDL,3)
// B2CON<B2FILHIT0>
extern volatile __bit                   B2FILHIT0           __at(0x7500);	// @ (0xEA0 * 8 + 0)
#define                                 B2FILHIT0_bit       _BIT_ACCESS(B2CON,0)
// B2CON<B2FILHIT1>
extern volatile __bit                   B2FILHIT1           __at(0x7501);	// @ (0xEA0 * 8 + 1)
#define                                 B2FILHIT1_bit       _BIT_ACCESS(B2CON,1)
// B2CON<B2FILHIT2>
extern volatile __bit                   B2FILHIT2           __at(0x7502);	// @ (0xEA0 * 8 + 2)
#define                                 B2FILHIT2_bit       _BIT_ACCESS(B2CON,2)
// B2CON<B2FILHIT3>
extern volatile __bit                   B2FILHIT3           __at(0x7503);	// @ (0xEA0 * 8 + 3)
#define                                 B2FILHIT3_bit       _BIT_ACCESS(B2CON,3)
// B2CON<B2FILHIT4>
extern volatile __bit                   B2FILHIT4           __at(0x7504);	// @ (0xEA0 * 8 + 4)
#define                                 B2FILHIT4_bit       _BIT_ACCESS(B2CON,4)
// BIE0<B2IE>
extern volatile __bit                   B2IE                __at(0x73F4);	// @ (0xE7E * 8 + 4)
#define                                 B2IE_bit            _BIT_ACCESS(BIE0,4)
// B2DLC<B2RB0>
extern volatile __bit                   B2RB0               __at(0x752C);	// @ (0xEA5 * 8 + 4)
#define                                 B2RB0_bit           _BIT_ACCESS(B2DLC,4)
// B2DLC<B2RB1>
extern volatile __bit                   B2RB1               __at(0x752D);	// @ (0xEA5 * 8 + 5)
#define                                 B2RB1_bit           _BIT_ACCESS(B2DLC,5)
// B2CON<B2RTREN>
extern volatile __bit                   B2RTREN             __at(0x7502);	// @ (0xEA0 * 8 + 2)
#define                                 B2RTREN_bit         _BIT_ACCESS(B2CON,2)
// B2CON<B2RTRRO>
extern volatile __bit                   B2RTRRO             __at(0x7505);	// @ (0xEA0 * 8 + 5)
#define                                 B2RTRRO_bit         _BIT_ACCESS(B2CON,5)
// B2CON<B2RXFUL>
extern volatile __bit                   B2RXFUL             __at(0x7507);	// @ (0xEA0 * 8 + 7)
#define                                 B2RXFUL_bit         _BIT_ACCESS(B2CON,7)
// B2CON<B2RXM1>
extern volatile __bit                   B2RXM1              __at(0x7506);	// @ (0xEA0 * 8 + 6)
#define                                 B2RXM1_bit          _BIT_ACCESS(B2CON,6)
// B2DLC<B2RXRTR>
extern volatile __bit                   B2RXRTR             __at(0x752E);	// @ (0xEA5 * 8 + 6)
#define                                 B2RXRTR_bit         _BIT_ACCESS(B2DLC,6)
// B2SIDL<B2SID0>
extern volatile __bit                   B2SID0              __at(0x7515);	// @ (0xEA2 * 8 + 5)
#define                                 B2SID0_bit          _BIT_ACCESS(B2SIDL,5)
// B2SIDL<B2SID1>
extern volatile __bit                   B2SID1              __at(0x7516);	// @ (0xEA2 * 8 + 6)
#define                                 B2SID1_bit          _BIT_ACCESS(B2SIDL,6)
// B2SIDH<B2SID10>
extern volatile __bit                   B2SID10             __at(0x750F);	// @ (0xEA1 * 8 + 7)
#define                                 B2SID10_bit         _BIT_ACCESS(B2SIDH,7)
// B2SIDL<B2SID2>
extern volatile __bit                   B2SID2              __at(0x7517);	// @ (0xEA2 * 8 + 7)
#define                                 B2SID2_bit          _BIT_ACCESS(B2SIDL,7)
// B2SIDH<B2SID3>
extern volatile __bit                   B2SID3              __at(0x7508);	// @ (0xEA1 * 8 + 0)
#define                                 B2SID3_bit          _BIT_ACCESS(B2SIDH,0)
// B2SIDH<B2SID4>
extern volatile __bit                   B2SID4              __at(0x7509);	// @ (0xEA1 * 8 + 1)
#define                                 B2SID4_bit          _BIT_ACCESS(B2SIDH,1)
// B2SIDH<B2SID5>
extern volatile __bit                   B2SID5              __at(0x750A);	// @ (0xEA1 * 8 + 2)
#define                                 B2SID5_bit          _BIT_ACCESS(B2SIDH,2)
// B2SIDH<B2SID6>
extern volatile __bit                   B2SID6              __at(0x750B);	// @ (0xEA1 * 8 + 3)
#define                                 B2SID6_bit          _BIT_ACCESS(B2SIDH,3)
// B2SIDH<B2SID7>
extern volatile __bit                   B2SID7              __at(0x750C);	// @ (0xEA1 * 8 + 4)
#define                                 B2SID7_bit          _BIT_ACCESS(B2SIDH,4)
// B2SIDH<B2SID8>
extern volatile __bit                   B2SID8              __at(0x750D);	// @ (0xEA1 * 8 + 5)
#define                                 B2SID8_bit          _BIT_ACCESS(B2SIDH,5)
// B2SIDH<B2SID9>
extern volatile __bit                   B2SID9              __at(0x750E);	// @ (0xEA1 * 8 + 6)
#define                                 B2SID9_bit          _BIT_ACCESS(B2SIDH,6)
// B2SIDL<B2SRR>
extern volatile __bit                   B2SRR               __at(0x7514);	// @ (0xEA2 * 8 + 4)
#define                                 B2SRR_bit           _BIT_ACCESS(B2SIDL,4)
// B2CON<B2TXABT>
extern volatile __bit                   B2TXABT             __at(0x7506);	// @ (0xEA0 * 8 + 6)
#define                                 B2TXABT_bit         _BIT_ACCESS(B2CON,6)
// B2CON<B2TXB3IF>
extern volatile __bit                   B2TXB3IF            __at(0x7507);	// @ (0xEA0 * 8 + 7)
#define                                 B2TXB3IF_bit        _BIT_ACCESS(B2CON,7)
// BSEL0<B2TXEN>
extern volatile __bit                   B2TXEN              __at(0x73EC);	// @ (0xE7D * 8 + 4)
#define                                 B2TXEN_bit          _BIT_ACCESS(BSEL0,4)
// B2CON<B2TXERR>
extern volatile __bit                   B2TXERR             __at(0x7504);	// @ (0xEA0 * 8 + 4)
#define                                 B2TXERR_bit         _BIT_ACCESS(B2CON,4)
// B2CON<B2TXLARB>
extern volatile __bit                   B2TXLARB            __at(0x7505);	// @ (0xEA0 * 8 + 5)
#define                                 B2TXLARB_bit        _BIT_ACCESS(B2CON,5)
// B2CON<B2TXPRI0>
extern volatile __bit                   B2TXPRI0            __at(0x7500);	// @ (0xEA0 * 8 + 0)
#define                                 B2TXPRI0_bit        _BIT_ACCESS(B2CON,0)
// B2CON<B2TXPRI1>
extern volatile __bit                   B2TXPRI1            __at(0x7501);	// @ (0xEA0 * 8 + 1)
#define                                 B2TXPRI1_bit        _BIT_ACCESS(B2CON,1)
// B2CON<B2TXREQ>
extern volatile __bit                   B2TXREQ             __at(0x7503);	// @ (0xEA0 * 8 + 3)
#define                                 B2TXREQ_bit         _BIT_ACCESS(B2CON,3)
// B3D0<B3D00>
extern volatile __bit                   B3D00               __at(0x75B0);	// @ (0xEB6 * 8 + 0)
#define                                 B3D00_bit           _BIT_ACCESS(B3D0,0)
// B3D0<B3D01>
extern volatile __bit                   B3D01               __at(0x75B1);	// @ (0xEB6 * 8 + 1)
#define                                 B3D01_bit           _BIT_ACCESS(B3D0,1)
// B3D0<B3D02>
extern volatile __bit                   B3D02               __at(0x75B2);	// @ (0xEB6 * 8 + 2)
#define                                 B3D02_bit           _BIT_ACCESS(B3D0,2)
// B3D0<B3D03>
extern volatile __bit                   B3D03               __at(0x75B3);	// @ (0xEB6 * 8 + 3)
#define                                 B3D03_bit           _BIT_ACCESS(B3D0,3)
// B3D0<B3D04>
extern volatile __bit                   B3D04               __at(0x75B4);	// @ (0xEB6 * 8 + 4)
#define                                 B3D04_bit           _BIT_ACCESS(B3D0,4)
// B3D0<B3D05>
extern volatile __bit                   B3D05               __at(0x75B5);	// @ (0xEB6 * 8 + 5)
#define                                 B3D05_bit           _BIT_ACCESS(B3D0,5)
// B3D0<B3D06>
extern volatile __bit                   B3D06               __at(0x75B6);	// @ (0xEB6 * 8 + 6)
#define                                 B3D06_bit           _BIT_ACCESS(B3D0,6)
// B3D0<B3D07>
extern volatile __bit                   B3D07               __at(0x75B7);	// @ (0xEB6 * 8 + 7)
#define                                 B3D07_bit           _BIT_ACCESS(B3D0,7)
// B3D1<B3D10>
extern volatile __bit                   B3D10               __at(0x75B8);	// @ (0xEB7 * 8 + 0)
#define                                 B3D10_bit           _BIT_ACCESS(B3D1,0)
// B3D1<B3D11>
extern volatile __bit                   B3D11               __at(0x75B9);	// @ (0xEB7 * 8 + 1)
#define                                 B3D11_bit           _BIT_ACCESS(B3D1,1)
// B3D1<B3D12>
extern volatile __bit                   B3D12               __at(0x75BA);	// @ (0xEB7 * 8 + 2)
#define                                 B3D12_bit           _BIT_ACCESS(B3D1,2)
// B3D1<B3D13>
extern volatile __bit                   B3D13               __at(0x75BB);	// @ (0xEB7 * 8 + 3)
#define                                 B3D13_bit           _BIT_ACCESS(B3D1,3)
// B3D1<B3D14>
extern volatile __bit                   B3D14               __at(0x75BC);	// @ (0xEB7 * 8 + 4)
#define                                 B3D14_bit           _BIT_ACCESS(B3D1,4)
// B3D1<B3D15>
extern volatile __bit                   B3D15               __at(0x75BD);	// @ (0xEB7 * 8 + 5)
#define                                 B3D15_bit           _BIT_ACCESS(B3D1,5)
// B3D1<B3D16>
extern volatile __bit                   B3D16               __at(0x75BE);	// @ (0xEB7 * 8 + 6)
#define                                 B3D16_bit           _BIT_ACCESS(B3D1,6)
// B3D1<B3D17>
extern volatile __bit                   B3D17               __at(0x75BF);	// @ (0xEB7 * 8 + 7)
#define                                 B3D17_bit           _BIT_ACCESS(B3D1,7)
// B3D2<B3D20>
extern volatile __bit                   B3D20               __at(0x75C0);	// @ (0xEB8 * 8 + 0)
#define                                 B3D20_bit           _BIT_ACCESS(B3D2,0)
// B3D2<B3D21>
extern volatile __bit                   B3D21               __at(0x75C1);	// @ (0xEB8 * 8 + 1)
#define                                 B3D21_bit           _BIT_ACCESS(B3D2,1)
// B3D2<B3D22>
extern volatile __bit                   B3D22               __at(0x75C2);	// @ (0xEB8 * 8 + 2)
#define                                 B3D22_bit           _BIT_ACCESS(B3D2,2)
// B3D2<B3D23>
extern volatile __bit                   B3D23               __at(0x75C3);	// @ (0xEB8 * 8 + 3)
#define                                 B3D23_bit           _BIT_ACCESS(B3D2,3)
// B3D2<B3D24>
extern volatile __bit                   B3D24               __at(0x75C4);	// @ (0xEB8 * 8 + 4)
#define                                 B3D24_bit           _BIT_ACCESS(B3D2,4)
// B3D2<B3D25>
extern volatile __bit                   B3D25               __at(0x75C5);	// @ (0xEB8 * 8 + 5)
#define                                 B3D25_bit           _BIT_ACCESS(B3D2,5)
// B3D2<B3D26>
extern volatile __bit                   B3D26               __at(0x75C6);	// @ (0xEB8 * 8 + 6)
#define                                 B3D26_bit           _BIT_ACCESS(B3D2,6)
// B3D2<B3D27>
extern volatile __bit                   B3D27               __at(0x75C7);	// @ (0xEB8 * 8 + 7)
#define                                 B3D27_bit           _BIT_ACCESS(B3D2,7)
// B3D3<B3D30>
extern volatile __bit                   B3D30               __at(0x75C8);	// @ (0xEB9 * 8 + 0)
#define                                 B3D30_bit           _BIT_ACCESS(B3D3,0)
// B3D3<B3D31>
extern volatile __bit                   B3D31               __at(0x75C9);	// @ (0xEB9 * 8 + 1)
#define                                 B3D31_bit           _BIT_ACCESS(B3D3,1)
// B3D3<B3D32>
extern volatile __bit                   B3D32               __at(0x75CA);	// @ (0xEB9 * 8 + 2)
#define                                 B3D32_bit           _BIT_ACCESS(B3D3,2)
// B3D3<B3D33>
extern volatile __bit                   B3D33               __at(0x75CB);	// @ (0xEB9 * 8 + 3)
#define                                 B3D33_bit           _BIT_ACCESS(B3D3,3)
// B3D3<B3D34>
extern volatile __bit                   B3D34               __at(0x75CC);	// @ (0xEB9 * 8 + 4)
#define                                 B3D34_bit           _BIT_ACCESS(B3D3,4)
// B3D3<B3D35>
extern volatile __bit                   B3D35               __at(0x75CD);	// @ (0xEB9 * 8 + 5)
#define                                 B3D35_bit           _BIT_ACCESS(B3D3,5)
// B3D3<B3D36>
extern volatile __bit                   B3D36               __at(0x75CE);	// @ (0xEB9 * 8 + 6)
#define                                 B3D36_bit           _BIT_ACCESS(B3D3,6)
// B3D3<B3D37>
extern volatile __bit                   B3D37               __at(0x75CF);	// @ (0xEB9 * 8 + 7)
#define                                 B3D37_bit           _BIT_ACCESS(B3D3,7)
// B3D4<B3D40>
extern volatile __bit                   B3D40               __at(0x75D0);	// @ (0xEBA * 8 + 0)
#define                                 B3D40_bit           _BIT_ACCESS(B3D4,0)
// B3D4<B3D41>
extern volatile __bit                   B3D41               __at(0x75D1);	// @ (0xEBA * 8 + 1)
#define                                 B3D41_bit           _BIT_ACCESS(B3D4,1)
// B3D4<B3D42>
extern volatile __bit                   B3D42               __at(0x75D2);	// @ (0xEBA * 8 + 2)
#define                                 B3D42_bit           _BIT_ACCESS(B3D4,2)
// B3D4<B3D43>
extern volatile __bit                   B3D43               __at(0x75D3);	// @ (0xEBA * 8 + 3)
#define                                 B3D43_bit           _BIT_ACCESS(B3D4,3)
// B3D4<B3D44>
extern volatile __bit                   B3D44               __at(0x75D4);	// @ (0xEBA * 8 + 4)
#define                                 B3D44_bit           _BIT_ACCESS(B3D4,4)
// B3D4<B3D45>
extern volatile __bit                   B3D45               __at(0x75D5);	// @ (0xEBA * 8 + 5)
#define                                 B3D45_bit           _BIT_ACCESS(B3D4,5)
// B3D4<B3D46>
extern volatile __bit                   B3D46               __at(0x75D6);	// @ (0xEBA * 8 + 6)
#define                                 B3D46_bit           _BIT_ACCESS(B3D4,6)
// B3D4<B3D47>
extern volatile __bit                   B3D47               __at(0x75D7);	// @ (0xEBA * 8 + 7)
#define                                 B3D47_bit           _BIT_ACCESS(B3D4,7)
// B3D5<B3D50>
extern volatile __bit                   B3D50               __at(0x75D8);	// @ (0xEBB * 8 + 0)
#define                                 B3D50_bit           _BIT_ACCESS(B3D5,0)
// B3D5<B3D51>
extern volatile __bit                   B3D51               __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 B3D51_bit           _BIT_ACCESS(B3D5,1)
// B3D5<B3D52>
extern volatile __bit                   B3D52               __at(0x75DA);	// @ (0xEBB * 8 + 2)
#define                                 B3D52_bit           _BIT_ACCESS(B3D5,2)
// B3D5<B3D53>
extern volatile __bit                   B3D53               __at(0x75DB);	// @ (0xEBB * 8 + 3)
#define                                 B3D53_bit           _BIT_ACCESS(B3D5,3)
// B3D5<B3D54>
extern volatile __bit                   B3D54               __at(0x75DC);	// @ (0xEBB * 8 + 4)
#define                                 B3D54_bit           _BIT_ACCESS(B3D5,4)
// B3D5<B3D55>
extern volatile __bit                   B3D55               __at(0x75DD);	// @ (0xEBB * 8 + 5)
#define                                 B3D55_bit           _BIT_ACCESS(B3D5,5)
// B3D5<B3D56>
extern volatile __bit                   B3D56               __at(0x75DE);	// @ (0xEBB * 8 + 6)
#define                                 B3D56_bit           _BIT_ACCESS(B3D5,6)
// B3D5<B3D57>
extern volatile __bit                   B3D57               __at(0x75DF);	// @ (0xEBB * 8 + 7)
#define                                 B3D57_bit           _BIT_ACCESS(B3D5,7)
// B3D6<B3D60>
extern volatile __bit                   B3D60               __at(0x75E0);	// @ (0xEBC * 8 + 0)
#define                                 B3D60_bit           _BIT_ACCESS(B3D6,0)
// B3D6<B3D61>
extern volatile __bit                   B3D61               __at(0x75E1);	// @ (0xEBC * 8 + 1)
#define                                 B3D61_bit           _BIT_ACCESS(B3D6,1)
// B3D6<B3D62>
extern volatile __bit                   B3D62               __at(0x75E2);	// @ (0xEBC * 8 + 2)
#define                                 B3D62_bit           _BIT_ACCESS(B3D6,2)
// B3D6<B3D63>
extern volatile __bit                   B3D63               __at(0x75E3);	// @ (0xEBC * 8 + 3)
#define                                 B3D63_bit           _BIT_ACCESS(B3D6,3)
// B3D6<B3D64>
extern volatile __bit                   B3D64               __at(0x75E4);	// @ (0xEBC * 8 + 4)
#define                                 B3D64_bit           _BIT_ACCESS(B3D6,4)
// B3D6<B3D65>
extern volatile __bit                   B3D65               __at(0x75E5);	// @ (0xEBC * 8 + 5)
#define                                 B3D65_bit           _BIT_ACCESS(B3D6,5)
// B3D6<B3D66>
extern volatile __bit                   B3D66               __at(0x75E6);	// @ (0xEBC * 8 + 6)
#define                                 B3D66_bit           _BIT_ACCESS(B3D6,6)
// B3D6<B3D67>
extern volatile __bit                   B3D67               __at(0x75E7);	// @ (0xEBC * 8 + 7)
#define                                 B3D67_bit           _BIT_ACCESS(B3D6,7)
// B3D7<B3D70>
extern volatile __bit                   B3D70               __at(0x75E8);	// @ (0xEBD * 8 + 0)
#define                                 B3D70_bit           _BIT_ACCESS(B3D7,0)
// B3D7<B3D71>
extern volatile __bit                   B3D71               __at(0x75E9);	// @ (0xEBD * 8 + 1)
#define                                 B3D71_bit           _BIT_ACCESS(B3D7,1)
// B3D7<B3D72>
extern volatile __bit                   B3D72               __at(0x75EA);	// @ (0xEBD * 8 + 2)
#define                                 B3D72_bit           _BIT_ACCESS(B3D7,2)
// B3D7<B3D73>
extern volatile __bit                   B3D73               __at(0x75EB);	// @ (0xEBD * 8 + 3)
#define                                 B3D73_bit           _BIT_ACCESS(B3D7,3)
// B3D7<B3D74>
extern volatile __bit                   B3D74               __at(0x75EC);	// @ (0xEBD * 8 + 4)
#define                                 B3D74_bit           _BIT_ACCESS(B3D7,4)
// B3D7<B3D75>
extern volatile __bit                   B3D75               __at(0x75ED);	// @ (0xEBD * 8 + 5)
#define                                 B3D75_bit           _BIT_ACCESS(B3D7,5)
// B3D7<B3D76>
extern volatile __bit                   B3D76               __at(0x75EE);	// @ (0xEBD * 8 + 6)
#define                                 B3D76_bit           _BIT_ACCESS(B3D7,6)
// B3D7<B3D77>
extern volatile __bit                   B3D77               __at(0x75EF);	// @ (0xEBD * 8 + 7)
#define                                 B3D77_bit           _BIT_ACCESS(B3D7,7)
// B3DLC<B3DLC0>
extern volatile __bit                   B3DLC0              __at(0x75A8);	// @ (0xEB5 * 8 + 0)
#define                                 B3DLC0_bit          _BIT_ACCESS(B3DLC,0)
// B3DLC<B3DLC1>
extern volatile __bit                   B3DLC1              __at(0x75A9);	// @ (0xEB5 * 8 + 1)
#define                                 B3DLC1_bit          _BIT_ACCESS(B3DLC,1)
// B3DLC<B3DLC2>
extern volatile __bit                   B3DLC2              __at(0x75AA);	// @ (0xEB5 * 8 + 2)
#define                                 B3DLC2_bit          _BIT_ACCESS(B3DLC,2)
// B3DLC<B3DLC3>
extern volatile __bit                   B3DLC3              __at(0x75AB);	// @ (0xEB5 * 8 + 3)
#define                                 B3DLC3_bit          _BIT_ACCESS(B3DLC,3)
// B3EIDL<B3EID0>
extern volatile __bit                   B3EID0              __at(0x75A0);	// @ (0xEB4 * 8 + 0)
#define                                 B3EID0_bit          _BIT_ACCESS(B3EIDL,0)
// B3EIDL<B3EID1>
extern volatile __bit                   B3EID1              __at(0x75A1);	// @ (0xEB4 * 8 + 1)
#define                                 B3EID1_bit          _BIT_ACCESS(B3EIDL,1)
// B3EIDH<B3EID10>
extern volatile __bit                   B3EID10             __at(0x759A);	// @ (0xEB3 * 8 + 2)
#define                                 B3EID10_bit         _BIT_ACCESS(B3EIDH,2)
// B3EIDH<B3EID11>
extern volatile __bit                   B3EID11             __at(0x759B);	// @ (0xEB3 * 8 + 3)
#define                                 B3EID11_bit         _BIT_ACCESS(B3EIDH,3)
// B3EIDH<B3EID12>
extern volatile __bit                   B3EID12             __at(0x759C);	// @ (0xEB3 * 8 + 4)
#define                                 B3EID12_bit         _BIT_ACCESS(B3EIDH,4)
// B3EIDH<B3EID13>
extern volatile __bit                   B3EID13             __at(0x759D);	// @ (0xEB3 * 8 + 5)
#define                                 B3EID13_bit         _BIT_ACCESS(B3EIDH,5)
// B3EIDH<B3EID14>
extern volatile __bit                   B3EID14             __at(0x759E);	// @ (0xEB3 * 8 + 6)
#define                                 B3EID14_bit         _BIT_ACCESS(B3EIDH,6)
// B3EIDH<B3EID15>
extern volatile __bit                   B3EID15             __at(0x759F);	// @ (0xEB3 * 8 + 7)
#define                                 B3EID15_bit         _BIT_ACCESS(B3EIDH,7)
// B3SIDL<B3EID16>
extern volatile __bit                   B3EID16             __at(0x7590);	// @ (0xEB2 * 8 + 0)
#define                                 B3EID16_bit         _BIT_ACCESS(B3SIDL,0)
// B3SIDL<B3EID17>
extern volatile __bit                   B3EID17             __at(0x7591);	// @ (0xEB2 * 8 + 1)
#define                                 B3EID17_bit         _BIT_ACCESS(B3SIDL,1)
// B3EIDL<B3EID2>
extern volatile __bit                   B3EID2              __at(0x75A2);	// @ (0xEB4 * 8 + 2)
#define                                 B3EID2_bit          _BIT_ACCESS(B3EIDL,2)
// B3EIDL<B3EID3>
extern volatile __bit                   B3EID3              __at(0x75A3);	// @ (0xEB4 * 8 + 3)
#define                                 B3EID3_bit          _BIT_ACCESS(B3EIDL,3)
// B3EIDL<B3EID4>
extern volatile __bit                   B3EID4              __at(0x75A4);	// @ (0xEB4 * 8 + 4)
#define                                 B3EID4_bit          _BIT_ACCESS(B3EIDL,4)
// B3EIDL<B3EID5>
extern volatile __bit                   B3EID5              __at(0x75A5);	// @ (0xEB4 * 8 + 5)
#define                                 B3EID5_bit          _BIT_ACCESS(B3EIDL,5)
// B3EIDL<B3EID6>
extern volatile __bit                   B3EID6              __at(0x75A6);	// @ (0xEB4 * 8 + 6)
#define                                 B3EID6_bit          _BIT_ACCESS(B3EIDL,6)
// B3EIDL<B3EID7>
extern volatile __bit                   B3EID7              __at(0x75A7);	// @ (0xEB4 * 8 + 7)
