MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K80/mcu.h
extern volatile __bit                   CFGS                __at(0x7BFE);	// @ (0xF7F * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x7E16);	// @ (0xFC2 * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// ADCON1<CHSN0>
extern volatile __bit                   CHSN0               __at(0x7E08);	// @ (0xFC1 * 8 + 0)
#define                                 CHSN0_bit           _BIT_ACCESS(ADCON1,0)
// ADCON1<CHSN1>
extern volatile __bit                   CHSN1               __at(0x7E09);	// @ (0xFC1 * 8 + 1)
#define                                 CHSN1_bit           _BIT_ACCESS(ADCON1,1)
// ADCON1<CHSN2>
extern volatile __bit                   CHSN2               __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 CHSN2_bit           _BIT_ACCESS(ADCON1,2)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// SSPSTAT<CKE>
extern volatile __bit                   CKE                 __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSPSTAT,6)
// SSPCON1<CKP>
extern volatile __bit                   CKP                 __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSPCON1,4)
// BAUDCON1<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7D3C);	// @ (0xFA7 * 8 + 4)
#define                                 CKTXP_bit           _BIT_ACCESS(BAUDCON1,4)
// CIOCON<CLKSEL>
extern volatile __bit                   CLKSEL              __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 CLKSEL_bit          _BIT_ACCESS(CIOCON,0)
// RCON<CM>
extern volatile __bit                   CM                  __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 CM_bit              _BIT_ACCESS(RCON,5)
// PIE4<CMP1IE>
extern volatile __bit                   CMP1IE              __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 CMP1IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<CMP1IF>
extern volatile __bit                   CMP1IF              __at(0x7DBC);	// @ (0xFB7 * 8 + 4)
#define                                 CMP1IF_bit          _BIT_ACCESS(PIR4,4)
// IPR4<CMP1IP>
extern volatile __bit                   CMP1IP              __at(0x7DC4);	// @ (0xFB8 * 8 + 4)
#define                                 CMP1IP_bit          _BIT_ACCESS(IPR4,4)
// PMD2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x7AB8);	// @ (0xF57 * 8 + 0)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD2,0)
// CMSTAT<CMP1OUT>
extern volatile __bit                   CMP1OUT             __at(0x7DA6);	// @ (0xFB4 * 8 + 6)
#define                                 CMP1OUT_bit         _BIT_ACCESS(CMSTAT,6)
// PIE4<CMP2IE>
extern volatile __bit                   CMP2IE              __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 CMP2IE_bit          _BIT_ACCESS(PIE4,5)
// PIR4<CMP2IF>
extern volatile __bit                   CMP2IF              __at(0x7DBD);	// @ (0xFB7 * 8 + 5)
#define                                 CMP2IF_bit          _BIT_ACCESS(PIR4,5)
// IPR4<CMP2IP>
extern volatile __bit                   CMP2IP              __at(0x7DC5);	// @ (0xFB8 * 8 + 5)
#define                                 CMP2IP_bit          _BIT_ACCESS(IPR4,5)
// PMD2<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x7AB9);	// @ (0xF57 * 8 + 1)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMD2,1)
// CMSTAT<CMP2OUT>
extern volatile __bit                   CMP2OUT             __at(0x7DA7);	// @ (0xFB4 * 8 + 7)
#define                                 CMP2OUT_bit         _BIT_ACCESS(CMSTAT,7)
// PSTR1CON<CMPL0>
extern volatile __bit                   CMPL0               __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 CMPL0_bit           _BIT_ACCESS(PSTR1CON,6)
// PSTR1CON<CMPL1>
extern volatile __bit                   CMPL1               __at(0x7CE7);	// @ (0xF9C * 8 + 7)
#define                                 CMPL1_bit           _BIT_ACCESS(PSTR1CON,7)
// CM1CON<COE1>
extern volatile __bit                   COE1                __at(0x7AFE);	// @ (0xF5F * 8 + 6)
#define                                 COE1_bit            _BIT_ACCESS(CM1CON,6)
// CM2CON<COE2>
extern volatile __bit                   COE2                __at(0x7AF6);	// @ (0xF5E * 8 + 6)
#define                                 COE2_bit            _BIT_ACCESS(CM2CON,6)
// CM1CON<CON1>
extern volatile __bit                   CON1                __at(0x7AFF);	// @ (0xF5F * 8 + 7)
#define                                 CON1_bit            _BIT_ACCESS(CM1CON,7)
// CM2CON<CON2>
extern volatile __bit                   CON2                __at(0x7AF7);	// @ (0xF5E * 8 + 7)
#define                                 CON2_bit            _BIT_ACCESS(CM2CON,7)
// CM1CON<CPOL1>
extern volatile __bit                   CPOL1               __at(0x7AFD);	// @ (0xF5F * 8 + 5)
#define                                 CPOL1_bit           _BIT_ACCESS(CM1CON,5)
// CM2CON<CPOL2>
extern volatile __bit                   CPOL2               __at(0x7AF5);	// @ (0xF5E * 8 + 5)
#define                                 CPOL2_bit           _BIT_ACCESS(CM2CON,5)
// CM1CON<CREF1>
extern volatile __bit                   CREF1               __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 CREF1_bit           _BIT_ACCESS(CM1CON,2)
// CM2CON<CREF2>
extern volatile __bit                   CREF2               __at(0x7AF2);	// @ (0xF5E * 8 + 2)
#define                                 CREF2_bit           _BIT_ACCESS(CM2CON,2)
// RCSTA1<CREN1>
extern volatile __bit                   CREN1               __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CREN1_bit           _BIT_ACCESS(RCSTA1,4)
// RCSTA2<CREN2>
extern volatile __bit                   CREN2               __at(0x7D34);	// @ (0xFA6 * 8 + 4)
#define                                 CREN2_bit           _BIT_ACCESS(RCSTA2,4)
// PORTE<CS>
extern volatile __bit                   CS                  __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CS_bit              _BIT_ACCESS(PORTE,2)
// TXSTA1<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA1,7)
// TXSTA2<CSRC2>
extern volatile __bit                   CSRC2               __at(0x7DD7);	// @ (0xFBA * 8 + 7)
#define                                 CSRC2_bit           _BIT_ACCESS(TXSTA2,7)
// PADCFG1<CTMUDS>
extern volatile __bit                   CTMUDS              __at(0x7AB0);	// @ (0xF56 * 8 + 0)
#define                                 CTMUDS_bit          _BIT_ACCESS(PADCFG1,0)
// CTMUCONH<CTMUEN>
extern volatile __bit                   CTMUEN              __at(0x7AAF);	// @ (0xF55 * 8 + 7)
#define                                 CTMUEN_bit          _BIT_ACCESS(CTMUCONH,7)
// PIE3<CTMUIE>
extern volatile __bit                   CTMUIE              __at(0x7D1B);	// @ (0xFA3 * 8 + 3)
#define                                 CTMUIE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<CTMUIF>
extern volatile __bit                   CTMUIF              __at(0x7D23);	// @ (0xFA4 * 8 + 3)
#define                                 CTMUIF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<CTMUIP>
extern volatile __bit                   CTMUIP              __at(0x7D2B);	// @ (0xFA5 * 8 + 3)
#define                                 CTMUIP_bit          _BIT_ACCESS(IPR3,3)
// PMD1<CTMUMD>
extern volatile __bit                   CTMUMD              __at(0x7AC6);	// @ (0xF58 * 8 + 6)
#define                                 CTMUMD_bit          _BIT_ACCESS(PMD1,6)
// CTMUCONH<CTMUSIDL>
extern volatile __bit                   CTMUSIDL            __at(0x7AAD);	// @ (0xF55 * 8 + 5)
#define                                 CTMUSIDL_bit        _BIT_ACCESS(CTMUCONH,5)
// CTMUCONH<CTTRIG>
extern volatile __bit                   CTTRIG              __at(0x7AA8);	// @ (0xF55 * 8 + 0)
#define                                 CTTRIG_bit          _BIT_ACCESS(CTMUCONH,0)
// CVRCON<CVR0>
extern volatile __bit                   CVR0                __at(0x7DA8);	// @ (0xFB5 * 8 + 0)
#define                                 CVR0_bit            _BIT_ACCESS(CVRCON,0)
// CVRCON<CVR1>
extern volatile __bit                   CVR1                __at(0x7DA9);	// @ (0xFB5 * 8 + 1)
#define                                 CVR1_bit            _BIT_ACCESS(CVRCON,1)
// CVRCON<CVR2>
extern volatile __bit                   CVR2                __at(0x7DAA);	// @ (0xFB5 * 8 + 2)
#define                                 CVR2_bit            _BIT_ACCESS(CVRCON,2)
// CVRCON<CVR3>
extern volatile __bit                   CVR3                __at(0x7DAB);	// @ (0xFB5 * 8 + 3)
#define                                 CVR3_bit            _BIT_ACCESS(CVRCON,3)
// CVRCON<CVR4>
extern volatile __bit                   CVR4                __at(0x7DAC);	// @ (0xFB5 * 8 + 4)
#define                                 CVR4_bit            _BIT_ACCESS(CVRCON,4)
// CVRCON<CVREN>
extern volatile __bit                   CVREN               __at(0x7DAF);	// @ (0xFB5 * 8 + 7)
#define                                 CVREN_bit           _BIT_ACCESS(CVRCON,7)
// CVRCON<CVROE>
extern volatile __bit                   CVROE               __at(0x7DAE);	// @ (0xFB5 * 8 + 6)
#define                                 CVROE_bit           _BIT_ACCESS(CVRCON,6)
// CVRCON<CVROEN>
extern volatile __bit                   CVROEN              __at(0x7DAE);	// @ (0xFB5 * 8 + 6)
#define                                 CVROEN_bit          _BIT_ACCESS(CVRCON,6)
// CVRCON<CVRR>
extern volatile __bit                   CVRR                __at(0x7DAD);	// @ (0xFB5 * 8 + 5)
#define                                 CVRR_bit            _BIT_ACCESS(CVRCON,5)
// CVRCON<CVRSS>
extern volatile __bit                   CVRSS               __at(0x7DAD);	// @ (0xFB5 * 8 + 5)
#define                                 CVRSS_bit           _BIT_ACCESS(CVRCON,5)
// SSPSTAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSPSTAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DDC);	// @ (0xFBB * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DDD);	// @ (0xFBB * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x7A84);	// @ (0xF50 * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x7A85);	// @ (0xF50 * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// CCP3CON<DC3B0>
extern volatile __bit                   DC3B0               __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 DC3B0_bit           _BIT_ACCESS(CCP3CON,4)
// CCP3CON<DC3B1>
extern volatile __bit                   DC3B1               __at(0x7A6D);	// @ (0xF4D * 8 + 5)
#define                                 DC3B1_bit           _BIT_ACCESS(CCP3CON,5)
// CCP4CON<DC4B0>
extern volatile __bit                   DC4B0               __at(0x7A54);	// @ (0xF4A * 8 + 4)
#define                                 DC4B0_bit           _BIT_ACCESS(CCP4CON,4)
// CCP4CON<DC4B1>
extern volatile __bit                   DC4B1               __at(0x7A55);	// @ (0xF4A * 8 + 5)
#define                                 DC4B1_bit           _BIT_ACCESS(CCP4CON,5)
// CCP5CON<DC5B0>
extern volatile __bit                   DC5B0               __at(0x7A3C);	// @ (0xF47 * 8 + 4)
#define                                 DC5B0_bit           _BIT_ACCESS(CCP5CON,4)
// CCP5CON<DC5B1>
extern volatile __bit                   DC5B1               __at(0x7A3D);	// @ (0xF47 * 8 + 5)
#define                                 DC5B1_bit           _BIT_ACCESS(CCP5CON,5)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,1)
// BIE0<DRXB0IE>
extern volatile __bit                   DRXB0IE             __at(0x73F0);	// @ (0xE7E * 8 + 0)
#define                                 DRXB0IE_bit         _BIT_ACCESS(BIE0,0)
// BIE0<DRXB1IE>
extern volatile __bit                   DRXB1IE             __at(0x73F1);	// @ (0xE7E * 8 + 1)
#define                                 DRXB1IE_bit         _BIT_ACCESS(BIE0,1)
// BAUDCON1<DTRXP>
extern volatile __bit                   DTRXP               __at(0x7D3D);	// @ (0xFA7 * 8 + 5)
#define                                 DTRXP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<DTRXP1>
extern volatile __bit                   DTRXP1              __at(0x7D3D);	// @ (0xFA7 * 8 + 5)
#define                                 DTRXP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<DTRXP2>
extern volatile __bit                   DTRXP2              __at(0x7DCD);	// @ (0xFB9 * 8 + 5)
#define                                 DTRXP2_bit          _BIT_ACCESS(BAUDCON2,5)
// SSPSTAT<D_A>
extern volatile __bit                   D_A                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_A_bit             _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<D_NOT_A>
extern volatile __bit                   D_NOT_A             __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_NOT_A_bit         _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<D_nA>
extern volatile __bit                   D_nA                __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSPSTAT,5)
// PR2<EBDIS>
extern volatile __bit                   EBDIS               __at(0x7E5F);	// @ (0xFCB * 8 + 7)
#define                                 EBDIS_bit           _BIT_ACCESS(_PR2,7)  // Note: Changed by MikroE
// PMD2<ECANMD>
extern volatile __bit                   ECANMD              __at(0x7ABA);	// @ (0xF57 * 8 + 2)
#define                                 ECANMD_bit          _BIT_ACCESS(PMD2,2)
// ECCP1AS<ECCP1AS0>
extern volatile __bit                   ECCP1AS0            __at(0x7DFC);	// @ (0xFBF * 8 + 4)
#define                                 ECCP1AS0_bit        _BIT_ACCESS(ECCP1AS,4)
// ECCP1AS<ECCP1AS1>
extern volatile __bit                   ECCP1AS1            __at(0x7DFD);	// @ (0xFBF * 8 + 5)
#define                                 ECCP1AS1_bit        _BIT_ACCESS(ECCP1AS,5)
// ECCP1AS<ECCP1AS2>
extern volatile __bit                   ECCP1AS2            __at(0x7DFE);	// @ (0xFBF * 8 + 6)
#define                                 ECCP1AS2_bit        _BIT_ACCESS(ECCP1AS,6)
// ECCP1AS<ECCP1ASE>
extern volatile __bit                   ECCP1ASE            __at(0x7DFF);	// @ (0xFBF * 8 + 7)
#define                                 ECCP1ASE_bit        _BIT_ACCESS(ECCP1AS,7)
// CTMUCONL<EDG1POL>
extern volatile __bit                   EDG1POL             __at(0x7AA4);	// @ (0xF54 * 8 + 4)
#define                                 EDG1POL_bit         _BIT_ACCESS(CTMUCONL,4)
// CTMUCONL<EDG1SEL0>
extern volatile __bit                   EDG1SEL0            __at(0x7AA2);	// @ (0xF54 * 8 + 2)
#define                                 EDG1SEL0_bit        _BIT_ACCESS(CTMUCONL,2)
// CTMUCONL<EDG1SEL1>
extern volatile __bit                   EDG1SEL1            __at(0x7AA3);	// @ (0xF54 * 8 + 3)
#define                                 EDG1SEL1_bit        _BIT_ACCESS(CTMUCONL,3)
// CTMUCONL<EDG1STAT>
extern volatile __bit                   EDG1STAT            __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 EDG1STAT_bit        _BIT_ACCESS(CTMUCONL,0)
// CTMUCONL<EDG2POL>
extern volatile __bit                   EDG2POL             __at(0x7AA7);	// @ (0xF54 * 8 + 7)
#define                                 EDG2POL_bit         _BIT_ACCESS(CTMUCONL,7)
// CTMUCONL<EDG2SEL0>
extern volatile __bit                   EDG2SEL0            __at(0x7AA5);	// @ (0xF54 * 8 + 5)
#define                                 EDG2SEL0_bit        _BIT_ACCESS(CTMUCONL,5)
// CTMUCONL<EDG2SEL1>
extern volatile __bit                   EDG2SEL1            __at(0x7AA6);	// @ (0xF54 * 8 + 6)
#define                                 EDG2SEL1_bit        _BIT_ACCESS(CTMUCONL,6)
// CTMUCONL<EDG2STAT>
extern volatile __bit                   EDG2STAT            __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 EDG2STAT_bit        _BIT_ACCESS(CTMUCONL,1)
// CTMUCONH<EDGEN>
extern volatile __bit                   EDGEN               __at(0x7AAB);	// @ (0xF55 * 8 + 3)
#define                                 EDGEN_bit           _BIT_ACCESS(CTMUCONH,3)
// CTMUCONH<EDGSEQEN>
extern volatile __bit                   EDGSEQEN            __at(0x7AAA);	// @ (0xF55 * 8 + 2)
#define                                 EDGSEQEN_bit        _BIT_ACCESS(CTMUCONH,2)
// RXB1SIDL<EDI16>
extern volatile __bit                   EDI16               __at(0x7990);	// @ (0xF32 * 8 + 0)
#define                                 EDI16_bit           _BIT_ACCESS(RXB1SIDL,0)
// RXB1SIDL<EDI17>
extern volatile __bit                   EDI17               __at(0x7991);	// @ (0xF32 * 8 + 1)
#define                                 EDI17_bit           _BIT_ACCESS(RXB1SIDL,1)
// EECON1<EEFS>
extern volatile __bit                   EEFS                __at(0x7BFE);	// @ (0xF7F * 8 + 6)
#define                                 EEFS_bit            _BIT_ACCESS(EECON1,6)
// PIE4<EEIE>
extern volatile __bit                   EEIE                __at(0x7DB6);	// @ (0xFB6 * 8 + 6)
#define                                 EEIE_bit            _BIT_ACCESS(PIE4,6)
// PIR4<EEIF>
extern volatile __bit                   EEIF                __at(0x7DBE);	// @ (0xFB7 * 8 + 6)
#define                                 EEIF_bit            _BIT_ACCESS(PIR4,6)
// IPR4<EEIP>
extern volatile __bit                   EEIP                __at(0x7DC6);	// @ (0xFB8 * 8 + 6)
#define                                 EEIP_bit            _BIT_ACCESS(IPR4,6)
// EECON1<EEPGD>
extern volatile __bit                   EEPGD               __at(0x7BFF);	// @ (0xF7F * 8 + 7)
#define                                 EEPGD_bit           _BIT_ACCESS(EECON1,7)
// PMD1<EMBMD>
extern volatile __bit                   EMBMD               __at(0x7AC0);	// @ (0xF58 * 8 + 0)
#define                                 EMBMD_bit           _BIT_ACCESS(PMD1,0)
// CIOCON<ENDRHI>
extern volatile __bit                   ENDRHI              __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 ENDRHI_bit          _BIT_ACCESS(CIOCON,5)
// PIE5<ERRIE>
extern volatile __bit                   ERRIE               __at(0x7BB5);	// @ (0xF76 * 8 + 5)
#define                                 ERRIE_bit           _BIT_ACCESS(PIE5,5)
// PIR5<ERRIF>
extern volatile __bit                   ERRIF               __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 ERRIF_bit           _BIT_ACCESS(PIR5,5)
// IPR5<ERRIP>
extern volatile __bit                   ERRIP               __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 ERRIP_bit           _BIT_ACCESS(IPR5,5)
// CM1CON<EVPOL01>
extern volatile __bit                   EVPOL01             __at(0x7AFB);	// @ (0xF5F * 8 + 3)
#define                                 EVPOL01_bit         _BIT_ACCESS(CM1CON,3)
// CM2CON<EVPOL02>
extern volatile __bit                   EVPOL02             __at(0x7AF3);	// @ (0xF5E * 8 + 3)
#define                                 EVPOL02_bit         _BIT_ACCESS(CM2CON,3)
// IPR5<EVPOL05>
extern volatile __bit                   EVPOL05             __at(0x7BC3);	// @ (0xF78 * 8 + 3)
#define                                 EVPOL05_bit         _BIT_ACCESS(IPR5,3)
// CM1CON<EVPOL11>
extern volatile __bit                   EVPOL11             __at(0x7AFC);	// @ (0xF5F * 8 + 4)
#define                                 EVPOL11_bit         _BIT_ACCESS(CM1CON,4)
// CM2CON<EVPOL12>
extern volatile __bit                   EVPOL12             __at(0x7AF4);	// @ (0xF5E * 8 + 4)
#define                                 EVPOL12_bit         _BIT_ACCESS(CM2CON,4)
// IPR5<EVPOL15>
extern volatile __bit                   EVPOL15             __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 EVPOL15_bit         _BIT_ACCESS(IPR5,4)
// COMSTAT<EWARN>
extern volatile __bit                   EWARN               __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 EWARN_bit           _BIT_ACCESS(COMSTAT,0)
// ECANCON<EWIN0>
extern volatile __bit                   EWIN0               __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 EWIN0_bit           _BIT_ACCESS(ECANCON,0)
// ECANCON<EWIN1>
extern volatile __bit                   EWIN1               __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 EWIN1_bit           _BIT_ACCESS(ECANCON,1)
// ECANCON<EWIN2>
extern volatile __bit                   EWIN2               __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 EWIN2_bit           _BIT_ACCESS(ECANCON,2)
// ECANCON<EWIN3>
extern volatile __bit                   EWIN3               __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 EWIN3_bit           _BIT_ACCESS(ECANCON,3)
// ECANCON<EWIN4>
extern volatile __bit                   EWIN4               __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 EWIN4_bit           _BIT_ACCESS(ECANCON,4)
// RXFBCON0<F0BP_0>
extern volatile __bit                   F0BP_0              __at(0x7388);	// @ (0xE71 * 8 + 0)
#define                                 F0BP_0_bit          _BIT_ACCESS(RXFBCON0,0)
// RXFBCON0<F0BP_01>
extern volatile __bit                   F0BP_01             __at(0x7388);	// @ (0xE71 * 8 + 0)
#define                                 F0BP_01_bit         _BIT_ACCESS(RXFBCON0,0)
// RXFBCON0<F0BP_1>
extern volatile __bit                   F0BP_1              __at(0x7389);	// @ (0xE71 * 8 + 1)
#define                                 F0BP_1_bit          _BIT_ACCESS(RXFBCON0,1)
// RXFBCON0<F0BP_2>
