MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K80/mcu.h
#define                                 RXM0SID2_bit        _BIT_ACCESS(RXM0SIDL,7)
// RXM0SIDH<RXM0SID3>
extern volatile __bit                   RXM0SID3            __at(0x77C0);	// @ (0xEF8 * 8 + 0)
#define                                 RXM0SID3_bit        _BIT_ACCESS(RXM0SIDH,0)
// RXM0SIDH<RXM0SID4>
extern volatile __bit                   RXM0SID4            __at(0x77C1);	// @ (0xEF8 * 8 + 1)
#define                                 RXM0SID4_bit        _BIT_ACCESS(RXM0SIDH,1)
// RXM0SIDH<RXM0SID5>
extern volatile __bit                   RXM0SID5            __at(0x77C2);	// @ (0xEF8 * 8 + 2)
#define                                 RXM0SID5_bit        _BIT_ACCESS(RXM0SIDH,2)
// RXM0SIDH<RXM0SID6>
extern volatile __bit                   RXM0SID6            __at(0x77C3);	// @ (0xEF8 * 8 + 3)
#define                                 RXM0SID6_bit        _BIT_ACCESS(RXM0SIDH,3)
// RXM0SIDH<RXM0SID7>
extern volatile __bit                   RXM0SID7            __at(0x77C4);	// @ (0xEF8 * 8 + 4)
#define                                 RXM0SID7_bit        _BIT_ACCESS(RXM0SIDH,4)
// RXM0SIDH<RXM0SID8>
extern volatile __bit                   RXM0SID8            __at(0x77C5);	// @ (0xEF8 * 8 + 5)
#define                                 RXM0SID8_bit        _BIT_ACCESS(RXM0SIDH,5)
// RXM0SIDH<RXM0SID9>
extern volatile __bit                   RXM0SID9            __at(0x77C6);	// @ (0xEF8 * 8 + 6)
#define                                 RXM0SID9_bit        _BIT_ACCESS(RXM0SIDH,6)
// RXM1EIDL<RXM1EID0>
extern volatile __bit                   RXM1EID0            __at(0x77F8);	// @ (0xEFF * 8 + 0)
#define                                 RXM1EID0_bit        _BIT_ACCESS(RXM1EIDL,0)
// RXM1EIDL<RXM1EID1>
extern volatile __bit                   RXM1EID1            __at(0x77F9);	// @ (0xEFF * 8 + 1)
#define                                 RXM1EID1_bit        _BIT_ACCESS(RXM1EIDL,1)
// RXM1EIDH<RXM1EID10>
extern volatile __bit                   RXM1EID10           __at(0x77F2);	// @ (0xEFE * 8 + 2)
#define                                 RXM1EID10_bit       _BIT_ACCESS(RXM1EIDH,2)
// RXM1EIDH<RXM1EID11>
extern volatile __bit                   RXM1EID11           __at(0x77F3);	// @ (0xEFE * 8 + 3)
#define                                 RXM1EID11_bit       _BIT_ACCESS(RXM1EIDH,3)
// RXM1EIDH<RXM1EID12>
extern volatile __bit                   RXM1EID12           __at(0x77F4);	// @ (0xEFE * 8 + 4)
#define                                 RXM1EID12_bit       _BIT_ACCESS(RXM1EIDH,4)
// RXM1EIDH<RXM1EID13>
extern volatile __bit                   RXM1EID13           __at(0x77F5);	// @ (0xEFE * 8 + 5)
#define                                 RXM1EID13_bit       _BIT_ACCESS(RXM1EIDH,5)
// RXM1EIDH<RXM1EID14>
extern volatile __bit                   RXM1EID14           __at(0x77F6);	// @ (0xEFE * 8 + 6)
#define                                 RXM1EID14_bit       _BIT_ACCESS(RXM1EIDH,6)
// RXM1EIDH<RXM1EID15>
extern volatile __bit                   RXM1EID15           __at(0x77F7);	// @ (0xEFE * 8 + 7)
#define                                 RXM1EID15_bit       _BIT_ACCESS(RXM1EIDH,7)
// RXM1SIDL<RXM1EID16>
extern volatile __bit                   RXM1EID16           __at(0x77E8);	// @ (0xEFD * 8 + 0)
#define                                 RXM1EID16_bit       _BIT_ACCESS(RXM1SIDL,0)
// RXM1SIDL<RXM1EID17>
extern volatile __bit                   RXM1EID17           __at(0x77E9);	// @ (0xEFD * 8 + 1)
#define                                 RXM1EID17_bit       _BIT_ACCESS(RXM1SIDL,1)
// RXM1EIDL<RXM1EID2>
extern volatile __bit                   RXM1EID2            __at(0x77FA);	// @ (0xEFF * 8 + 2)
#define                                 RXM1EID2_bit        _BIT_ACCESS(RXM1EIDL,2)
// RXM1EIDL<RXM1EID3>
extern volatile __bit                   RXM1EID3            __at(0x77FB);	// @ (0xEFF * 8 + 3)
#define                                 RXM1EID3_bit        _BIT_ACCESS(RXM1EIDL,3)
// RXM1EIDL<RXM1EID4>
extern volatile __bit                   RXM1EID4            __at(0x77FC);	// @ (0xEFF * 8 + 4)
#define                                 RXM1EID4_bit        _BIT_ACCESS(RXM1EIDL,4)
// RXM1EIDL<RXM1EID5>
extern volatile __bit                   RXM1EID5            __at(0x77FD);	// @ (0xEFF * 8 + 5)
#define                                 RXM1EID5_bit        _BIT_ACCESS(RXM1EIDL,5)
// RXM1EIDL<RXM1EID6>
extern volatile __bit                   RXM1EID6            __at(0x77FE);	// @ (0xEFF * 8 + 6)
#define                                 RXM1EID6_bit        _BIT_ACCESS(RXM1EIDL,6)
// RXM1EIDL<RXM1EID7>
extern volatile __bit                   RXM1EID7            __at(0x77FF);	// @ (0xEFF * 8 + 7)
#define                                 RXM1EID7_bit        _BIT_ACCESS(RXM1EIDL,7)
// RXM1EIDH<RXM1EID8>
extern volatile __bit                   RXM1EID8            __at(0x77F0);	// @ (0xEFE * 8 + 0)
#define                                 RXM1EID8_bit        _BIT_ACCESS(RXM1EIDH,0)
// RXM1EIDH<RXM1EID9>
extern volatile __bit                   RXM1EID9            __at(0x77F1);	// @ (0xEFE * 8 + 1)
#define                                 RXM1EID9_bit        _BIT_ACCESS(RXM1EIDH,1)
// RXM1SIDL<RXM1EXIDEN>
extern volatile __bit                   RXM1EXIDEN          __at(0x77EB);	// @ (0xEFD * 8 + 3)
#define                                 RXM1EXIDEN_bit      _BIT_ACCESS(RXM1SIDL,3)
// RXM1SIDL<RXM1SID0>
extern volatile __bit                   RXM1SID0            __at(0x77ED);	// @ (0xEFD * 8 + 5)
#define                                 RXM1SID0_bit        _BIT_ACCESS(RXM1SIDL,5)
// RXM1SIDL<RXM1SID1>
extern volatile __bit                   RXM1SID1            __at(0x77EE);	// @ (0xEFD * 8 + 6)
#define                                 RXM1SID1_bit        _BIT_ACCESS(RXM1SIDL,6)
// RXM1SIDH<RXM1SID10>
extern volatile __bit                   RXM1SID10           __at(0x77E7);	// @ (0xEFC * 8 + 7)
#define                                 RXM1SID10_bit       _BIT_ACCESS(RXM1SIDH,7)
// RXM1SIDL<RXM1SID2>
extern volatile __bit                   RXM1SID2            __at(0x77EF);	// @ (0xEFD * 8 + 7)
#define                                 RXM1SID2_bit        _BIT_ACCESS(RXM1SIDL,7)
// RXM1SIDH<RXM1SID3>
extern volatile __bit                   RXM1SID3            __at(0x77E0);	// @ (0xEFC * 8 + 0)
#define                                 RXM1SID3_bit        _BIT_ACCESS(RXM1SIDH,0)
// RXM1SIDH<RXM1SID4>
extern volatile __bit                   RXM1SID4            __at(0x77E1);	// @ (0xEFC * 8 + 1)
#define                                 RXM1SID4_bit        _BIT_ACCESS(RXM1SIDH,1)
// RXM1SIDH<RXM1SID5>
extern volatile __bit                   RXM1SID5            __at(0x77E2);	// @ (0xEFC * 8 + 2)
#define                                 RXM1SID5_bit        _BIT_ACCESS(RXM1SIDH,2)
// RXM1SIDH<RXM1SID6>
extern volatile __bit                   RXM1SID6            __at(0x77E3);	// @ (0xEFC * 8 + 3)
#define                                 RXM1SID6_bit        _BIT_ACCESS(RXM1SIDH,3)
// RXM1SIDH<RXM1SID7>
extern volatile __bit                   RXM1SID7            __at(0x77E4);	// @ (0xEFC * 8 + 4)
#define                                 RXM1SID7_bit        _BIT_ACCESS(RXM1SIDH,4)
// RXM1SIDH<RXM1SID8>
extern volatile __bit                   RXM1SID8            __at(0x77E5);	// @ (0xEFC * 8 + 5)
#define                                 RXM1SID8_bit        _BIT_ACCESS(RXM1SIDH,5)
// RXM1SIDH<RXM1SID9>
extern volatile __bit                   RXM1SID9            __at(0x77E6);	// @ (0xEFC * 8 + 6)
#define                                 RXM1SID9_bit        _BIT_ACCESS(RXM1SIDH,6)
// COMSTAT<RXWARN>
extern volatile __bit                   RXWARN              __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 RXWARN_bit          _BIT_ACCESS(COMSTAT,1)
// SSPSTAT<R_NOT_W>
extern volatile __bit                   R_NOT_W             __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_NOT_W_bit         _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_W>
extern volatile __bit                   R_W                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_nW>
extern volatile __bit                   R_nW                __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSPSTAT,2)
// BRGCON2<SAM>
extern volatile __bit                   SAM                 __at(0x7226);	// @ (0xE44 * 8 + 6)
#define                                 SAM_bit             _BIT_ACCESS(BRGCON2,6)
// RCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x7E86);	// @ (0xFD0 * 8 + 6)
#define                                 SBOREN_bit          _BIT_ACCESS(RCON,6)
// BAUDCON1<SCKP>
extern volatile __bit                   SCKP                __at(0x7D3C);	// @ (0xFA7 * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUDCON1,4)
// BAUDCON1<SCKP1>
extern volatile __bit                   SCKP1               __at(0x7D3C);	// @ (0xFA7 * 8 + 4)
#define                                 SCKP1_bit           _BIT_ACCESS(BAUDCON1,4)
// BAUDCON2<SCKP2>
extern volatile __bit                   SCKP2               __at(0x7DCC);	// @ (0xFB9 * 8 + 4)
#define                                 SCKP2_bit           _BIT_ACCESS(BAUDCON2,4)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// BRGCON2<SEG1PH0>
extern volatile __bit                   SEG1PH0             __at(0x7223);	// @ (0xE44 * 8 + 3)
#define                                 SEG1PH0_bit         _BIT_ACCESS(BRGCON2,3)
// BRGCON2<SEG1PH1>
extern volatile __bit                   SEG1PH1             __at(0x7224);	// @ (0xE44 * 8 + 4)
#define                                 SEG1PH1_bit         _BIT_ACCESS(BRGCON2,4)
// BRGCON2<SEG1PH2>
extern volatile __bit                   SEG1PH2             __at(0x7225);	// @ (0xE44 * 8 + 5)
#define                                 SEG1PH2_bit         _BIT_ACCESS(BRGCON2,5)
// BRGCON3<SEG2PH0>
extern volatile __bit                   SEG2PH0             __at(0x7228);	// @ (0xE45 * 8 + 0)
#define                                 SEG2PH0_bit         _BIT_ACCESS(BRGCON3,0)
// BRGCON3<SEG2PH1>
extern volatile __bit                   SEG2PH1             __at(0x7229);	// @ (0xE45 * 8 + 1)
#define                                 SEG2PH1_bit         _BIT_ACCESS(BRGCON3,1)
// BRGCON3<SEG2PH2>
extern volatile __bit                   SEG2PH2             __at(0x722A);	// @ (0xE45 * 8 + 2)
#define                                 SEG2PH2_bit         _BIT_ACCESS(BRGCON3,2)
// BRGCON2<SEG2PHT>
extern volatile __bit                   SEG2PHT             __at(0x7227);	// @ (0xE44 * 8 + 7)
#define                                 SEG2PHT_bit         _BIT_ACCESS(BRGCON2,7)
// BRGCON2<SEG2PHTS>
extern volatile __bit                   SEG2PHTS            __at(0x7227);	// @ (0xE44 * 8 + 7)
#define                                 SEG2PHTS_bit        _BIT_ACCESS(BRGCON2,7)
// SSPCON2<SEN>
extern volatile __bit                   SEN                 __at(0x7E28);	// @ (0xFC5 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSPCON2,0)
// TXSTA1<SENDB1>
extern volatile __bit                   SENDB1              __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 SENDB1_bit          _BIT_ACCESS(TXSTA1,3)
// TXSTA2<SENDB2>
extern volatile __bit                   SENDB2              __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 SENDB2_bit          _BIT_ACCESS(TXSTA2,3)
// BRGCON1<SJW0>
extern volatile __bit                   SJW0                __at(0x721E);	// @ (0xE43 * 8 + 6)
#define                                 SJW0_bit            _BIT_ACCESS(BRGCON1,6)
// BRGCON1<SJW1>
extern volatile __bit                   SJW1                __at(0x721F);	// @ (0xE43 * 8 + 7)
#define                                 SJW1_bit            _BIT_ACCESS(BRGCON1,7)
// SLRCON<SLRA>
extern volatile __bit                   SLRA                __at(0x7C80);	// @ (0xF90 * 8 + 0)
#define                                 SLRA_bit            _BIT_ACCESS(SLRCON,0)
// SLRCON<SLRB>
extern volatile __bit                   SLRB                __at(0x7C81);	// @ (0xF90 * 8 + 1)
#define                                 SLRB_bit            _BIT_ACCESS(SLRCON,1)
// SLRCON<SLRC>
extern volatile __bit                   SLRC                __at(0x7C82);	// @ (0xF90 * 8 + 2)
#define                                 SLRC_bit            _BIT_ACCESS(SLRCON,2)
// SLRCON<SLRD>
extern volatile __bit                   SLRD                __at(0x7C83);	// @ (0xF90 * 8 + 3)
#define                                 SLRD_bit            _BIT_ACCESS(SLRCON,3)
// SLRCON<SLRE>
extern volatile __bit                   SLRE                __at(0x7C84);	// @ (0xF90 * 8 + 4)
#define                                 SLRE_bit            _BIT_ACCESS(SLRCON,4)
// SSPSTAT<SMP>
extern volatile __bit                   SMP                 __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSPSTAT,7)
// OSCCON2<SOSCDRV>
extern volatile __bit                   SOSCDRV             __at(0x7E94);	// @ (0xFD2 * 8 + 4)
#define                                 SOSCDRV_bit         _BIT_ACCESS(OSCCON2,4)
// T3CON<SOSCEN3>
extern volatile __bit                   SOSCEN3             __at(0x7D8B);	// @ (0xFB1 * 8 + 3)
#define                                 SOSCEN3_bit         _BIT_ACCESS(T3CON,3)
// OSCCON2<SOSCGO>
extern volatile __bit                   SOSCGO              __at(0x7E93);	// @ (0xFD2 * 8 + 3)
#define                                 SOSCGO_bit          _BIT_ACCESS(OSCCON2,3)
// OSCCON2<SOSCRUN>
extern volatile __bit                   SOSCRUN             __at(0x7E96);	// @ (0xFD2 * 8 + 6)
#define                                 SOSCRUN_bit         _BIT_ACCESS(OSCCON2,6)
// STKPTR<SP0>
extern volatile __bit                   SP0                 __at(0x7FE0);	// @ (0xFFC * 8 + 0)
#define                                 SP0_bit             _BIT_ACCESS(STKPTR,0)
// STKPTR<SP1>
extern volatile __bit                   SP1                 __at(0x7FE1);	// @ (0xFFC * 8 + 1)
#define                                 SP1_bit             _BIT_ACCESS(STKPTR,1)
// STKPTR<SP2>
extern volatile __bit                   SP2                 __at(0x7FE2);	// @ (0xFFC * 8 + 2)
#define                                 SP2_bit             _BIT_ACCESS(STKPTR,2)
// STKPTR<SP3>
extern volatile __bit                   SP3                 __at(0x7FE3);	// @ (0xFFC * 8 + 3)
#define                                 SP3_bit             _BIT_ACCESS(STKPTR,3)
// STKPTR<SP4>
extern volatile __bit                   SP4                 __at(0x7FE4);	// @ (0xFFC * 8 + 4)
#define                                 SP4_bit             _BIT_ACCESS(STKPTR,4)
// RCSTA1<SPEN1>
extern volatile __bit                   SPEN1               __at(0x7D5F);	// @ (0xFAB * 8 + 7)
#define                                 SPEN1_bit           _BIT_ACCESS(RCSTA1,7)
// RCSTA2<SPEN2>
extern volatile __bit                   SPEN2               __at(0x7D37);	// @ (0xFA6 * 8 + 7)
#define                                 SPEN2_bit           _BIT_ACCESS(RCSTA2,7)
// PMD0<SPI1MD>
extern volatile __bit                   SPI1MD              __at(0x7AC9);	// @ (0xF59 * 8 + 1)
#define                                 SPI1MD_bit          _BIT_ACCESS(PMD0,1)
// PMD0<SPI2MD>
extern volatile __bit                   SPI2MD              __at(0x7ACA);	// @ (0xF59 * 8 + 2)
#define                                 SPI2MD_bit          _BIT_ACCESS(PMD0,2)
// RCSTA1<SREN1>
extern volatile __bit                   SREN1               __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 SREN1_bit           _BIT_ACCESS(RCSTA1,5)
// RCSTA2<SREN2>
extern volatile __bit                   SREN2               __at(0x7D35);	// @ (0xFA6 * 8 + 5)
#define                                 SREN2_bit           _BIT_ACCESS(RCSTA2,5)
// RCSTA1<SRENA>
extern volatile __bit                   SRENA               __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 SRENA_bit           _BIT_ACCESS(RCSTA1,5)
// WDTCON<SRETEN>
extern volatile __bit                   SRETEN              __at(0x7E8C);	// @ (0xFD1 * 8 + 4)
#define                                 SRETEN_bit          _BIT_ACCESS(WDTCON,4)
// PORTD<SS2>
extern volatile __bit                   SS2                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 SS2_bit             _BIT_ACCESS(PORTD,7)
// SSPCON1<SSPEN>
extern volatile __bit                   SSPEN               __at(0x7E35);	// @ (0xFC6 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSPCON1,5)
// PIE1<SSPIE>
extern volatile __bit                   SSPIE               __at(0x7CEB);	// @ (0xF9D * 8 + 3)
#define                                 SSPIE_bit           _BIT_ACCESS(PIE1,3)
// PIR1<SSPIF>
extern volatile __bit                   SSPIF               __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 SSPIF_bit           _BIT_ACCESS(PIR1,3)
// IPR1<SSPIP>
extern volatile __bit                   SSPIP               __at(0x7CFB);	// @ (0xF9F * 8 + 3)
#define                                 SSPIP_bit           _BIT_ACCESS(IPR1,3)
// SSPCON1<SSPM0>
extern volatile __bit                   SSPM0               __at(0x7E30);	// @ (0xFC6 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSPCON1,0)
// SSPCON1<SSPM1>
extern volatile __bit                   SSPM1               __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSPCON1,1)
// SSPCON1<SSPM2>
extern volatile __bit                   SSPM2               __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSPCON1,2)
// SSPCON1<SSPM3>
extern volatile __bit                   SSPM3               __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSPCON1,3)
// PMD0<SSPMD>
extern volatile __bit                   SSPMD               __at(0x7AC8);	// @ (0xF59 * 8 + 0)
#define                                 SSPMD_bit           _BIT_ACCESS(PMD0,0)
// ODCON<SSPOD>
extern volatile __bit                   SSPOD               __at(0x7C8F);	// @ (0xF91 * 8 + 7)
#define                                 SSPOD_bit           _BIT_ACCESS(ODCON,7)
// SSPCON1<SSPOV>
extern volatile __bit                   SSPOV               __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSPCON1,6)
// SSPSTAT<START>
extern volatile __bit                   START               __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 START_bit           _BIT_ACCESS(SSPSTAT,3)
// STKPTR<STKFUL>
extern volatile __bit                   STKFUL              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKFUL_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKOVF>
extern volatile __bit                   STKOVF              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKUNF>
extern volatile __bit                   STKUNF              __at(0x7FE6);	// @ (0xFFC * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(STKPTR,6)
// SSPSTAT<STOP>
extern volatile __bit                   STOP                __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 STOP_bit            _BIT_ACCESS(SSPSTAT,4)
// PSTR1CON<STRA>
extern volatile __bit                   STRA                __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 STRA_bit            _BIT_ACCESS(PSTR1CON,0)
// PSTR1CON<STRB>
extern volatile __bit                   STRB                __at(0x7CE1);	// @ (0xF9C * 8 + 1)
#define                                 STRB_bit            _BIT_ACCESS(PSTR1CON,1)
// PSTR1CON<STRC>
extern volatile __bit                   STRC                __at(0x7CE2);	// @ (0xF9C * 8 + 2)
#define                                 STRC_bit            _BIT_ACCESS(PSTR1CON,2)
// PSTR1CON<STRD>
extern volatile __bit                   STRD                __at(0x7CE3);	// @ (0xF9C * 8 + 3)
#define                                 STRD_bit            _BIT_ACCESS(PSTR1CON,3)
// PSTR1CON<STRSYNC>
extern volatile __bit                   STRSYNC             __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 STRSYNC_bit         _BIT_ACCESS(PSTR1CON,4)
// WDTCON<SWDTE>
extern volatile __bit                   SWDTE               __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 SWDTE_bit           _BIT_ACCESS(WDTCON,0)
// WDTCON<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON,0)
// TXSTA1<SYNC1>
extern volatile __bit                   SYNC1               __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 SYNC1_bit           _BIT_ACCESS(TXSTA1,4)
// TXSTA2<SYNC2>
extern volatile __bit                   SYNC2               __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 SYNC2_bit           _BIT_ACCESS(TXSTA2,4)
// T0CON<T08BIT>
extern volatile __bit                   T08BIT              __at(0x7EAE);	// @ (0xFD5 * 8 + 6)
#define                                 T08BIT_bit          _BIT_ACCESS(T0CON,6)
// T0CON<T0CS>
extern volatile __bit                   T0CS                __at(0x7EAD);	// @ (0xFD5 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(T0CON,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x7F95);	// @ (0xFF2 * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x7F92);	// @ (0xFF2 * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// INTCON2<T0IP>
extern volatile __bit                   T0IP                __at(0x7F8A);	// @ (0xFF1 * 8 + 2)
#define                                 T0IP_bit            _BIT_ACCESS(INTCON2,2)
// T0CON<T0PS0>
extern volatile __bit                   T0PS0               __at(0x7EA8);	// @ (0xFD5 * 8 + 0)
#define                                 T0PS0_bit           _BIT_ACCESS(T0CON,0)
// T0CON<T0PS1>
extern volatile __bit                   T0PS1               __at(0x7EA9);	// @ (0xFD5 * 8 + 1)
#define                                 T0PS1_bit           _BIT_ACCESS(T0CON,1)
// T0CON<T0PS2>
extern volatile __bit                   T0PS2               __at(0x7EAA);	// @ (0xFD5 * 8 + 2)
#define                                 T0PS2_bit           _BIT_ACCESS(T0CON,2)
// T0CON<T0SE>
extern volatile __bit                   T0SE                __at(0x7EAC);	// @ (0xFD5 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(T0CON,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0x7E6C);	// @ (0xFCD * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0x7E6D);	// @ (0xFCD * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1GCON<T1GGO>
extern volatile __bit                   T1GGO               __at(0x7D53);	// @ (0xFAA * 8 + 3)
