MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K80/mcu.h
#define                                 TXB0SID6_bit        _BIT_ACCESS(TXB0SIDH,3)
// TXB0SIDH<TXB0SID7>
extern volatile __bit                   TXB0SID7            __at(0x790C);	// @ (0xF21 * 8 + 4)
#define                                 TXB0SID7_bit        _BIT_ACCESS(TXB0SIDH,4)
// TXB0SIDH<TXB0SID8>
extern volatile __bit                   TXB0SID8            __at(0x790D);	// @ (0xF21 * 8 + 5)
#define                                 TXB0SID8_bit        _BIT_ACCESS(TXB0SIDH,5)
// TXB0SIDH<TXB0SID9>
extern volatile __bit                   TXB0SID9            __at(0x790E);	// @ (0xF21 * 8 + 6)
#define                                 TXB0SID9_bit        _BIT_ACCESS(TXB0SIDH,6)
// TXB1CON<TXB1ABT>
extern volatile __bit                   TXB1ABT             __at(0x7886);	// @ (0xF10 * 8 + 6)
#define                                 TXB1ABT_bit         _BIT_ACCESS(TXB1CON,6)
// TXB1D0<TXB1D00>
extern volatile __bit                   TXB1D00             __at(0x78B0);	// @ (0xF16 * 8 + 0)
#define                                 TXB1D00_bit         _BIT_ACCESS(TXB1D0,0)
// TXB1D0<TXB1D01>
extern volatile __bit                   TXB1D01             __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 TXB1D01_bit         _BIT_ACCESS(TXB1D0,1)
// TXB1D0<TXB1D02>
extern volatile __bit                   TXB1D02             __at(0x78B2);	// @ (0xF16 * 8 + 2)
#define                                 TXB1D02_bit         _BIT_ACCESS(TXB1D0,2)
// TXB1D0<TXB1D03>
extern volatile __bit                   TXB1D03             __at(0x78B3);	// @ (0xF16 * 8 + 3)
#define                                 TXB1D03_bit         _BIT_ACCESS(TXB1D0,3)
// TXB1D0<TXB1D04>
extern volatile __bit                   TXB1D04             __at(0x78B4);	// @ (0xF16 * 8 + 4)
#define                                 TXB1D04_bit         _BIT_ACCESS(TXB1D0,4)
// TXB1D0<TXB1D05>
extern volatile __bit                   TXB1D05             __at(0x78B5);	// @ (0xF16 * 8 + 5)
#define                                 TXB1D05_bit         _BIT_ACCESS(TXB1D0,5)
// TXB1D0<TXB1D06>
extern volatile __bit                   TXB1D06             __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 TXB1D06_bit         _BIT_ACCESS(TXB1D0,6)
// TXB1D0<TXB1D07>
extern volatile __bit                   TXB1D07             __at(0x78B7);	// @ (0xF16 * 8 + 7)
#define                                 TXB1D07_bit         _BIT_ACCESS(TXB1D0,7)
// TXB1D1<TXB1D10>
extern volatile __bit                   TXB1D10             __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 TXB1D10_bit         _BIT_ACCESS(TXB1D1,0)
// TXB1D1<TXB1D11>
extern volatile __bit                   TXB1D11             __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 TXB1D11_bit         _BIT_ACCESS(TXB1D1,1)
// TXB1D1<TXB1D12>
extern volatile __bit                   TXB1D12             __at(0x78BA);	// @ (0xF17 * 8 + 2)
#define                                 TXB1D12_bit         _BIT_ACCESS(TXB1D1,2)
// TXB1D1<TXB1D13>
extern volatile __bit                   TXB1D13             __at(0x78BB);	// @ (0xF17 * 8 + 3)
#define                                 TXB1D13_bit         _BIT_ACCESS(TXB1D1,3)
// TXB1D1<TXB1D14>
extern volatile __bit                   TXB1D14             __at(0x78BC);	// @ (0xF17 * 8 + 4)
#define                                 TXB1D14_bit         _BIT_ACCESS(TXB1D1,4)
// TXB1D1<TXB1D15>
extern volatile __bit                   TXB1D15             __at(0x78BD);	// @ (0xF17 * 8 + 5)
#define                                 TXB1D15_bit         _BIT_ACCESS(TXB1D1,5)
// TXB1D1<TXB1D16>
extern volatile __bit                   TXB1D16             __at(0x78BE);	// @ (0xF17 * 8 + 6)
#define                                 TXB1D16_bit         _BIT_ACCESS(TXB1D1,6)
// TXB1D1<TXB1D17>
extern volatile __bit                   TXB1D17             __at(0x78BF);	// @ (0xF17 * 8 + 7)
#define                                 TXB1D17_bit         _BIT_ACCESS(TXB1D1,7)
// TXB1D2<TXB1D20>
extern volatile __bit                   TXB1D20             __at(0x78C0);	// @ (0xF18 * 8 + 0)
#define                                 TXB1D20_bit         _BIT_ACCESS(TXB1D2,0)
// TXB1D2<TXB1D21>
extern volatile __bit                   TXB1D21             __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 TXB1D21_bit         _BIT_ACCESS(TXB1D2,1)
// TXB1D2<TXB1D22>
extern volatile __bit                   TXB1D22             __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 TXB1D22_bit         _BIT_ACCESS(TXB1D2,2)
// TXB1D2<TXB1D23>
extern volatile __bit                   TXB1D23             __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 TXB1D23_bit         _BIT_ACCESS(TXB1D2,3)
// TXB1D2<TXB1D24>
extern volatile __bit                   TXB1D24             __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 TXB1D24_bit         _BIT_ACCESS(TXB1D2,4)
// TXB1D2<TXB1D25>
extern volatile __bit                   TXB1D25             __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 TXB1D25_bit         _BIT_ACCESS(TXB1D2,5)
// TXB1D2<TXB1D26>
extern volatile __bit                   TXB1D26             __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 TXB1D26_bit         _BIT_ACCESS(TXB1D2,6)
// TXB1D2<TXB1D27>
extern volatile __bit                   TXB1D27             __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 TXB1D27_bit         _BIT_ACCESS(TXB1D2,7)
// TXB1D3<TXB1D30>
extern volatile __bit                   TXB1D30             __at(0x78C8);	// @ (0xF19 * 8 + 0)
#define                                 TXB1D30_bit         _BIT_ACCESS(TXB1D3,0)
// TXB1D3<TXB1D31>
extern volatile __bit                   TXB1D31             __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 TXB1D31_bit         _BIT_ACCESS(TXB1D3,1)
// TXB1D3<TXB1D32>
extern volatile __bit                   TXB1D32             __at(0x78CA);	// @ (0xF19 * 8 + 2)
#define                                 TXB1D32_bit         _BIT_ACCESS(TXB1D3,2)
// TXB1D3<TXB1D33>
extern volatile __bit                   TXB1D33             __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 TXB1D33_bit         _BIT_ACCESS(TXB1D3,3)
// TXB1D3<TXB1D34>
extern volatile __bit                   TXB1D34             __at(0x78CC);	// @ (0xF19 * 8 + 4)
#define                                 TXB1D34_bit         _BIT_ACCESS(TXB1D3,4)
// TXB1D3<TXB1D35>
extern volatile __bit                   TXB1D35             __at(0x78CD);	// @ (0xF19 * 8 + 5)
#define                                 TXB1D35_bit         _BIT_ACCESS(TXB1D3,5)
// TXB1D3<TXB1D36>
extern volatile __bit                   TXB1D36             __at(0x78CE);	// @ (0xF19 * 8 + 6)
#define                                 TXB1D36_bit         _BIT_ACCESS(TXB1D3,6)
// TXB1D3<TXB1D37>
extern volatile __bit                   TXB1D37             __at(0x78CF);	// @ (0xF19 * 8 + 7)
#define                                 TXB1D37_bit         _BIT_ACCESS(TXB1D3,7)
// TXB1D4<TXB1D40>
extern volatile __bit                   TXB1D40             __at(0x78D0);	// @ (0xF1A * 8 + 0)
#define                                 TXB1D40_bit         _BIT_ACCESS(TXB1D4,0)
// TXB1D4<TXB1D41>
extern volatile __bit                   TXB1D41             __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 TXB1D41_bit         _BIT_ACCESS(TXB1D4,1)
// TXB1D4<TXB1D42>
extern volatile __bit                   TXB1D42             __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 TXB1D42_bit         _BIT_ACCESS(TXB1D4,2)
// TXB1D4<TXB1D43>
extern volatile __bit                   TXB1D43             __at(0x78D3);	// @ (0xF1A * 8 + 3)
#define                                 TXB1D43_bit         _BIT_ACCESS(TXB1D4,3)
// TXB1D4<TXB1D44>
extern volatile __bit                   TXB1D44             __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 TXB1D44_bit         _BIT_ACCESS(TXB1D4,4)
// TXB1D4<TXB1D45>
extern volatile __bit                   TXB1D45             __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 TXB1D45_bit         _BIT_ACCESS(TXB1D4,5)
// TXB1D4<TXB1D46>
extern volatile __bit                   TXB1D46             __at(0x78D6);	// @ (0xF1A * 8 + 6)
#define                                 TXB1D46_bit         _BIT_ACCESS(TXB1D4,6)
// TXB1D4<TXB1D47>
extern volatile __bit                   TXB1D47             __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 TXB1D47_bit         _BIT_ACCESS(TXB1D4,7)
// TXB1D5<TXB1D50>
extern volatile __bit                   TXB1D50             __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 TXB1D50_bit         _BIT_ACCESS(TXB1D5,0)
// TXB1D5<TXB1D51>
extern volatile __bit                   TXB1D51             __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 TXB1D51_bit         _BIT_ACCESS(TXB1D5,1)
// TXB1D5<TXB1D52>
extern volatile __bit                   TXB1D52             __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 TXB1D52_bit         _BIT_ACCESS(TXB1D5,2)
// TXB1D5<TXB1D53>
extern volatile __bit                   TXB1D53             __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 TXB1D53_bit         _BIT_ACCESS(TXB1D5,3)
// TXB1D5<TXB1D54>
extern volatile __bit                   TXB1D54             __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 TXB1D54_bit         _BIT_ACCESS(TXB1D5,4)
// TXB1D5<TXB1D55>
extern volatile __bit                   TXB1D55             __at(0x78DD);	// @ (0xF1B * 8 + 5)
#define                                 TXB1D55_bit         _BIT_ACCESS(TXB1D5,5)
// TXB1D5<TXB1D56>
extern volatile __bit                   TXB1D56             __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 TXB1D56_bit         _BIT_ACCESS(TXB1D5,6)
// TXB1D5<TXB1D57>
extern volatile __bit                   TXB1D57             __at(0x78DF);	// @ (0xF1B * 8 + 7)
#define                                 TXB1D57_bit         _BIT_ACCESS(TXB1D5,7)
// TXB1D6<TXB1D60>
extern volatile __bit                   TXB1D60             __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 TXB1D60_bit         _BIT_ACCESS(TXB1D6,0)
// TXB1D6<TXB1D61>
extern volatile __bit                   TXB1D61             __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 TXB1D61_bit         _BIT_ACCESS(TXB1D6,1)
// TXB1D6<TXB1D62>
extern volatile __bit                   TXB1D62             __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 TXB1D62_bit         _BIT_ACCESS(TXB1D6,2)
// TXB1D6<TXB1D63>
extern volatile __bit                   TXB1D63             __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 TXB1D63_bit         _BIT_ACCESS(TXB1D6,3)
// TXB1D6<TXB1D64>
extern volatile __bit                   TXB1D64             __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 TXB1D64_bit         _BIT_ACCESS(TXB1D6,4)
// TXB1D6<TXB1D65>
extern volatile __bit                   TXB1D65             __at(0x78E5);	// @ (0xF1C * 8 + 5)
#define                                 TXB1D65_bit         _BIT_ACCESS(TXB1D6,5)
// TXB1D6<TXB1D66>
extern volatile __bit                   TXB1D66             __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 TXB1D66_bit         _BIT_ACCESS(TXB1D6,6)
// TXB1D6<TXB1D67>
extern volatile __bit                   TXB1D67             __at(0x78E7);	// @ (0xF1C * 8 + 7)
#define                                 TXB1D67_bit         _BIT_ACCESS(TXB1D6,7)
// TXB1D7<TXB1D70>
extern volatile __bit                   TXB1D70             __at(0x78E8);	// @ (0xF1D * 8 + 0)
#define                                 TXB1D70_bit         _BIT_ACCESS(TXB1D7,0)
// TXB1D7<TXB1D71>
extern volatile __bit                   TXB1D71             __at(0x78E9);	// @ (0xF1D * 8 + 1)
#define                                 TXB1D71_bit         _BIT_ACCESS(TXB1D7,1)
// TXB1D7<TXB1D72>
extern volatile __bit                   TXB1D72             __at(0x78EA);	// @ (0xF1D * 8 + 2)
#define                                 TXB1D72_bit         _BIT_ACCESS(TXB1D7,2)
// TXB1D7<TXB1D73>
extern volatile __bit                   TXB1D73             __at(0x78EB);	// @ (0xF1D * 8 + 3)
#define                                 TXB1D73_bit         _BIT_ACCESS(TXB1D7,3)
// TXB1D7<TXB1D74>
extern volatile __bit                   TXB1D74             __at(0x78EC);	// @ (0xF1D * 8 + 4)
#define                                 TXB1D74_bit         _BIT_ACCESS(TXB1D7,4)
// TXB1D7<TXB1D75>
extern volatile __bit                   TXB1D75             __at(0x78ED);	// @ (0xF1D * 8 + 5)
#define                                 TXB1D75_bit         _BIT_ACCESS(TXB1D7,5)
// TXB1D7<TXB1D76>
extern volatile __bit                   TXB1D76             __at(0x78EE);	// @ (0xF1D * 8 + 6)
#define                                 TXB1D76_bit         _BIT_ACCESS(TXB1D7,6)
// TXB1D7<TXB1D77>
extern volatile __bit                   TXB1D77             __at(0x78EF);	// @ (0xF1D * 8 + 7)
#define                                 TXB1D77_bit         _BIT_ACCESS(TXB1D7,7)
// TXB1DLC<TXB1DLC0>
extern volatile __bit                   TXB1DLC0            __at(0x78A8);	// @ (0xF15 * 8 + 0)
#define                                 TXB1DLC0_bit        _BIT_ACCESS(TXB1DLC,0)
// TXB1DLC<TXB1DLC1>
extern volatile __bit                   TXB1DLC1            __at(0x78A9);	// @ (0xF15 * 8 + 1)
#define                                 TXB1DLC1_bit        _BIT_ACCESS(TXB1DLC,1)
// TXB1DLC<TXB1DLC2>
extern volatile __bit                   TXB1DLC2            __at(0x78AA);	// @ (0xF15 * 8 + 2)
#define                                 TXB1DLC2_bit        _BIT_ACCESS(TXB1DLC,2)
// TXB1DLC<TXB1DLC3>
extern volatile __bit                   TXB1DLC3            __at(0x78AB);	// @ (0xF15 * 8 + 3)
#define                                 TXB1DLC3_bit        _BIT_ACCESS(TXB1DLC,3)
// TXB1EIDL<TXB1EID0>
extern volatile __bit                   TXB1EID0            __at(0x78A0);	// @ (0xF14 * 8 + 0)
#define                                 TXB1EID0_bit        _BIT_ACCESS(TXB1EIDL,0)
// TXB1EIDL<TXB1EID1>
extern volatile __bit                   TXB1EID1            __at(0x78A1);	// @ (0xF14 * 8 + 1)
#define                                 TXB1EID1_bit        _BIT_ACCESS(TXB1EIDL,1)
// TXB1EIDH<TXB1EID10>
extern volatile __bit                   TXB1EID10           __at(0x789A);	// @ (0xF13 * 8 + 2)
#define                                 TXB1EID10_bit       _BIT_ACCESS(TXB1EIDH,2)
// TXB1EIDH<TXB1EID11>
extern volatile __bit                   TXB1EID11           __at(0x789B);	// @ (0xF13 * 8 + 3)
#define                                 TXB1EID11_bit       _BIT_ACCESS(TXB1EIDH,3)
// TXB1EIDH<TXB1EID12>
extern volatile __bit                   TXB1EID12           __at(0x789C);	// @ (0xF13 * 8 + 4)
#define                                 TXB1EID12_bit       _BIT_ACCESS(TXB1EIDH,4)
// TXB1EIDH<TXB1EID13>
extern volatile __bit                   TXB1EID13           __at(0x789D);	// @ (0xF13 * 8 + 5)
#define                                 TXB1EID13_bit       _BIT_ACCESS(TXB1EIDH,5)
// TXB1EIDH<TXB1EID14>
extern volatile __bit                   TXB1EID14           __at(0x789E);	// @ (0xF13 * 8 + 6)
#define                                 TXB1EID14_bit       _BIT_ACCESS(TXB1EIDH,6)
// TXB1EIDH<TXB1EID15>
extern volatile __bit                   TXB1EID15           __at(0x789F);	// @ (0xF13 * 8 + 7)
#define                                 TXB1EID15_bit       _BIT_ACCESS(TXB1EIDH,7)
// TXB1SIDL<TXB1EID16>
extern volatile __bit                   TXB1EID16           __at(0x7890);	// @ (0xF12 * 8 + 0)
#define                                 TXB1EID16_bit       _BIT_ACCESS(TXB1SIDL,0)
// TXB1SIDL<TXB1EID17>
extern volatile __bit                   TXB1EID17           __at(0x7891);	// @ (0xF12 * 8 + 1)
#define                                 TXB1EID17_bit       _BIT_ACCESS(TXB1SIDL,1)
// TXB1EIDL<TXB1EID2>
extern volatile __bit                   TXB1EID2            __at(0x78A2);	// @ (0xF14 * 8 + 2)
#define                                 TXB1EID2_bit        _BIT_ACCESS(TXB1EIDL,2)
// TXB1EIDL<TXB1EID3>
extern volatile __bit                   TXB1EID3            __at(0x78A3);	// @ (0xF14 * 8 + 3)
#define                                 TXB1EID3_bit        _BIT_ACCESS(TXB1EIDL,3)
// TXB1EIDL<TXB1EID4>
extern volatile __bit                   TXB1EID4            __at(0x78A4);	// @ (0xF14 * 8 + 4)
#define                                 TXB1EID4_bit        _BIT_ACCESS(TXB1EIDL,4)
// TXB1EIDL<TXB1EID5>
extern volatile __bit                   TXB1EID5            __at(0x78A5);	// @ (0xF14 * 8 + 5)
#define                                 TXB1EID5_bit        _BIT_ACCESS(TXB1EIDL,5)
// TXB1EIDL<TXB1EID6>
extern volatile __bit                   TXB1EID6            __at(0x78A6);	// @ (0xF14 * 8 + 6)
#define                                 TXB1EID6_bit        _BIT_ACCESS(TXB1EIDL,6)
// TXB1EIDL<TXB1EID7>
extern volatile __bit                   TXB1EID7            __at(0x78A7);	// @ (0xF14 * 8 + 7)
#define                                 TXB1EID7_bit        _BIT_ACCESS(TXB1EIDL,7)
// TXB1EIDH<TXB1EID8>
extern volatile __bit                   TXB1EID8            __at(0x7898);	// @ (0xF13 * 8 + 0)
#define                                 TXB1EID8_bit        _BIT_ACCESS(TXB1EIDH,0)
// TXB1EIDH<TXB1EID9>
extern volatile __bit                   TXB1EID9            __at(0x7899);	// @ (0xF13 * 8 + 1)
#define                                 TXB1EID9_bit        _BIT_ACCESS(TXB1EIDH,1)
// TXB1CON<TXB1ERR>
extern volatile __bit                   TXB1ERR             __at(0x7884);	// @ (0xF10 * 8 + 4)
#define                                 TXB1ERR_bit         _BIT_ACCESS(TXB1CON,4)
// TXB1SIDL<TXB1EXIDE>
extern volatile __bit                   TXB1EXIDE           __at(0x7893);	// @ (0xF12 * 8 + 3)
#define                                 TXB1EXIDE_bit       _BIT_ACCESS(TXB1SIDL,3)
// PIR5<TXB1IF>
extern volatile __bit                   TXB1IF              __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 TXB1IF_bit          _BIT_ACCESS(PIR5,3)
// IPR5<TXB1IP>
extern volatile __bit                   TXB1IP              __at(0x7BC3);	// @ (0xF78 * 8 + 3)
#define                                 TXB1IP_bit          _BIT_ACCESS(IPR5,3)
// TXB1CON<TXB1LARB>
extern volatile __bit                   TXB1LARB            __at(0x7885);	// @ (0xF10 * 8 + 5)
#define                                 TXB1LARB_bit        _BIT_ACCESS(TXB1CON,5)
// TXB1CON<TXB1PRI0>
extern volatile __bit                   TXB1PRI0            __at(0x7880);	// @ (0xF10 * 8 + 0)
#define                                 TXB1PRI0_bit        _BIT_ACCESS(TXB1CON,0)
// TXB1CON<TXB1PRI1>
extern volatile __bit                   TXB1PRI1            __at(0x7881);	// @ (0xF10 * 8 + 1)
#define                                 TXB1PRI1_bit        _BIT_ACCESS(TXB1CON,1)
// TXB1CON<TXB1REQ>
extern volatile __bit                   TXB1REQ             __at(0x7883);	// @ (0xF10 * 8 + 3)
#define                                 TXB1REQ_bit         _BIT_ACCESS(TXB1CON,3)
// TXB1DLC<TXB1RTR>
extern volatile __bit                   TXB1RTR             __at(0x78AE);	// @ (0xF15 * 8 + 6)
#define                                 TXB1RTR_bit         _BIT_ACCESS(TXB1DLC,6)
// TXB1SIDL<TXB1SID0>
extern volatile __bit                   TXB1SID0            __at(0x7895);	// @ (0xF12 * 8 + 5)
#define                                 TXB1SID0_bit        _BIT_ACCESS(TXB1SIDL,5)
// TXB1SIDL<TXB1SID1>
extern volatile __bit                   TXB1SID1            __at(0x7896);	// @ (0xF12 * 8 + 6)
#define                                 TXB1SID1_bit        _BIT_ACCESS(TXB1SIDL,6)
// TXB1SIDH<TXB1SID10>
extern volatile __bit                   TXB1SID10           __at(0x788F);	// @ (0xF11 * 8 + 7)
#define                                 TXB1SID10_bit       _BIT_ACCESS(TXB1SIDH,7)
// TXB1SIDL<TXB1SID2>
extern volatile __bit                   TXB1SID2            __at(0x7897);	// @ (0xF12 * 8 + 7)
#define                                 TXB1SID2_bit        _BIT_ACCESS(TXB1SIDL,7)
// TXB1SIDH<TXB1SID3>
extern volatile __bit                   TXB1SID3            __at(0x7888);	// @ (0xF11 * 8 + 0)
#define                                 TXB1SID3_bit        _BIT_ACCESS(TXB1SIDH,0)
// TXB1SIDH<TXB1SID4>
extern volatile __bit                   TXB1SID4            __at(0x7889);	// @ (0xF11 * 8 + 1)
#define                                 TXB1SID4_bit        _BIT_ACCESS(TXB1SIDH,1)
// TXB1SIDH<TXB1SID5>
extern volatile __bit                   TXB1SID5            __at(0x788A);	// @ (0xF11 * 8 + 2)
#define                                 TXB1SID5_bit        _BIT_ACCESS(TXB1SIDH,2)
// TXB1SIDH<TXB1SID6>
extern volatile __bit                   TXB1SID6            __at(0x788B);	// @ (0xF11 * 8 + 3)
#define                                 TXB1SID6_bit        _BIT_ACCESS(TXB1SIDH,3)
// TXB1SIDH<TXB1SID7>
extern volatile __bit                   TXB1SID7            __at(0x788C);	// @ (0xF11 * 8 + 4)
#define                                 TXB1SID7_bit        _BIT_ACCESS(TXB1SIDH,4)
// TXB1SIDH<TXB1SID8>
extern volatile __bit                   TXB1SID8            __at(0x788D);	// @ (0xF11 * 8 + 5)
#define                                 TXB1SID8_bit        _BIT_ACCESS(TXB1SIDH,5)
// TXB1SIDH<TXB1SID9>
extern volatile __bit                   TXB1SID9            __at(0x788E);	// @ (0xF11 * 8 + 6)
#define                                 TXB1SID9_bit        _BIT_ACCESS(TXB1SIDH,6)
// TXB2CON<TXB2ABT>
extern volatile __bit                   TXB2ABT             __at(0x7806);	// @ (0xF00 * 8 + 6)
#define                                 TXB2ABT_bit         _BIT_ACCESS(TXB2CON,6)
// TXB2D0<TXB2D00>
extern volatile __bit                   TXB2D00             __at(0x7830);	// @ (0xF06 * 8 + 0)
#define                                 TXB2D00_bit         _BIT_ACCESS(TXB2D0,0)
// TXB2D0<TXB2D01>
extern volatile __bit                   TXB2D01             __at(0x7831);	// @ (0xF06 * 8 + 1)
#define                                 TXB2D01_bit         _BIT_ACCESS(TXB2D0,1)
// TXB2D0<TXB2D02>
extern volatile __bit                   TXB2D02             __at(0x7832);	// @ (0xF06 * 8 + 2)
#define                                 TXB2D02_bit         _BIT_ACCESS(TXB2D0,2)
// TXB2D0<TXB2D03>
extern volatile __bit                   TXB2D03             __at(0x7833);	// @ (0xF06 * 8 + 3)
#define                                 TXB2D03_bit         _BIT_ACCESS(TXB2D0,3)
// TXB2D0<TXB2D04>
extern volatile __bit                   TXB2D04             __at(0x7834);	// @ (0xF06 * 8 + 4)
#define                                 TXB2D04_bit         _BIT_ACCESS(TXB2D0,4)
// TXB2D0<TXB2D05>
extern volatile __bit                   TXB2D05             __at(0x7835);	// @ (0xF06 * 8 + 5)
#define                                 TXB2D05_bit         _BIT_ACCESS(TXB2D0,5)
// TXB2D0<TXB2D06>
extern volatile __bit                   TXB2D06             __at(0x7836);	// @ (0xF06 * 8 + 6)
#define                                 TXB2D06_bit         _BIT_ACCESS(TXB2D0,6)
// TXB2D0<TXB2D07>
extern volatile __bit                   TXB2D07             __at(0x7837);	// @ (0xF06 * 8 + 7)
#define                                 TXB2D07_bit         _BIT_ACCESS(TXB2D0,7)
// TXB2D1<TXB2D10>
extern volatile __bit                   TXB2D10             __at(0x7838);	// @ (0xF07 * 8 + 0)
#define                                 TXB2D10_bit         _BIT_ACCESS(TXB2D1,0)
// TXB2D1<TXB2D11>
extern volatile __bit                   TXB2D11             __at(0x7839);	// @ (0xF07 * 8 + 1)
#define                                 TXB2D11_bit         _BIT_ACCESS(TXB2D1,1)
